Word	ID
<end-document> 0
<end-paragraph> 1
<end-sentence> 2
<unknown> 3
Apparently 4
Prides 5
Osteria 6
had 7
a 8
rough 9
summer 10
as 11
evidenced 12
by 13
the 14
almost 15
empty 16
dining 17
room 18
at 19
6:30 20
on 21
Friday 22
night. 23
However 24
new 25
blood 26
in 27
kitchen 28
seems 29
to 30
have 31
food 32
from 33
other 34
customers 35
recent 36
visits. 37
Waitstaff 38
was 39
warm 40
but 41
By 42
8 43
pm 44
or 45
so 46
when 47
we 48
left 49
bar 50
full 51
and 52
much 53
more 54
lively 55
than 56
it 57
been. 58
Perhaps 59
Beverly 60
residents 61
prefer 62
later 63
seating. 64
After 65
reading 66
mixed 67
reviews 68
of 69
late 70
I 71
little 72
tentative 73
over 74
our 75
choice 76
luckily 77
there 78
nothing 79
worry 80
about 81
department. 82
We 83
started 84
with 85
fried 86
dough, 87
burrata 88
prosciutto 89
which 90
were 91
all 92
lovely. 93
Then 94
although 95
they 96
don't 97
offer 98
half 99
portions 100
pasta 101
each 102
ordered 103
entree 104
size 105
split 106
them. 107
chose 108
tagliatelle 109
bolognese 110
four 111
cheese 112
filled 113
creamy 114
sauce 115
bacon, 116
asparagus 117
frita. 118
Both 119
very 120
good. 121
special 122
pork 123
described 124
skirt 125
steak 126
garlic 127
potato 128
broccoli 129
sauce). 130
Some 131
tables 132
received 133
bread 134
before 135
meal 136
for 137
some 138
reason 139
did 140
not. 141
Management 142
also 143
capable 144
tenants 145
apartment 146
above 147
began 148
playing 149
basketball 150
she 151
comped 152
dessert. 153
apple 154
dumpling 155
gelato 156
quite 157
tasty. 158
Portions 159
are 160
not 161
huge 162
particularly 163
like 164
because 165
order 166
courses. 167
If 168
you 169
someone 170
who 171
orders 172
just 173
may 174
leave 175
hungry 176
depending 177
appetite. 178
Dining 179
mostly 180
younger 181
crowd 182
while 183
definitely 184
40 185
set. 186
Would 187
recommend 188
that 189
naysayers 190
return 191
see 192
improvement 193
personally 194
know 195
former 196
be 197
able 198
compare. 199
Easy 200
access 201
downtown 202
Salem 203
without 204
crowds 205
this 206
month 207
October. 208
This 209
store 210
is 211
pretty 212
Not 213
great 214
Walmart 215
(or 216
my 217
closer 218
easier 219
area 220
get 221
to. 222
The 223
itself 224
clean 225
organized, 226
staff 227
friendly 228
BEST 229
Self 230
Checkout 231
Great 232
clearance 233
sections 234
prices 235
everything 236
store, 237
general 238
(they 239
too!). 240
Christian, 241
Jen 242
friendly, 243
helpful, 244
sensitive 245
customer 246
needs. 247
Definitely 248
one 249
better 250
Target 251
locations 252
area, 253
do 254
GREAT 255
job 256
assisting 257
being 258
such 259
busy 260
store. 261
Located 262
directly 263
Framingham 264
Mall 265
Rd 266
/ 267
Route 268
30. 269
4 270
stars. 271
called 272
recommendation 273
couple 274
friends 275
used 276
them 277
past 278
thought 279
nice 280
job. 281
I'm 282
fan 283
now, 284
too. 285
Evan 286
Cody 287
showed 288
up 289
right 290
time 291
move 292
weekend. 293
They 294
energetic, 295
working 296
quickly 297
carefully 298
things 299
moved 300
out 301
old 302
place 303
into 304
less 305
2.5 306
hours. 307
All 308
furniture 309
arrived 310
perfect 311
condition, 312
took 313
extra 314
care 315
scratch 316
wood 317
floors 318
process. 319
hope 320
again 321
anytime 322
soon, 323
next 324
do, 325
I'll 326
calling 327
I've 328
stayed 329
many 330
Marriott 331
Renaissance 332
Marriott's 333
disappointment! 334
front 335
desk 336
atrium 337
starbucks 338
site 339
nice. 340
rooms 341
run 342
down 343
old. 344
There 345
flat 346
screen 347
expected 348
got 349
hotel 350
via 351
Priceline 352
rate 353
deal 354
price 355
true 356
always 357
here. 358
service 359
both 360
manager 361
well 362
super. 363
Only 364
draw 365
back 366
restaurant 367
it's 368
super 369
loud. 370
can, 371
snag 372
patio 373
table! 374
cool, 375
chill 376
place. 377
Now 378
its 379
bunch 380
bouncers 381
hopped 382
acting 383
can 384
whatever 385
want. 386
places 387
davis 388
square 389
where 390
glad 391
visiting 392
their 393
business. 394
Sad 395
now 396
worst 397
setting 398
perfectly 399
adequate, 400
comes 401
close. 402
chains 403
Chilis 404
Victoria 405
Station 406
barbecue 407
better. 408
It's 409
no 410
surprise 411
pick 412
coupons 413
Linwood 414
restaurant.com. 415
Probably 416
breakfast 417
sandwiches 418
ever 419
had. 420
toasted 421
bacon 422
real 423
thick 424
cut. 425
lame 426
familiar 427
your 428
diner. 429
In 430
addition, 431
helpful. 432
butcher 433
several 434
different 435
cuts 436
available 437
knowledgable 438
friendly. 439
beef 440
am 441
excited 442
come 443
back! 444
Sports 445
particular 446
location 447
has 448
good 449
check 450
deal. 451
came 452
here 453
near 454
Christmas 455
buy 456
presents 457
experience. 458
members 459
helped 460
us 461
find 462
what 463
looking 464
for. 465
golf 466
stuff, 467
two 468
pairs 469
shoes, 470
tennis 471
bag, 472
bicycle 473
accessories. 474
organized. 475
between. 476
Good 477
spot 478
athletic 479
merchandise. 480
work 481
most 482
affordable 483
tasty 484
court. 485
deals 486
chicken 487
pesto 488
really 489
chowda 490
person 491
soups 492
damn 493
Broccoli 494
favorite. 495
Also, 496
probably 497
personable 498
Food 499
court 500
pleasure 501
ordering 502
from. 503
NEVER 504
seem 505
correct, 506
crappy, 507
inconsistent 508
gone 509
hill 510
steadily 511
last 512
6-9 513
months! 514
WILL 515
GO 516
THERE 517
AGAIN! 518
Disappointing. 519
Bolt 520
follow 521
closed. 522
Like 523
selection 524
small. 525
fabrics 526
lean 527
toward 528
contemporary. 529
small 530
stock 531
however, 532
enough 533
display 534
selections, 535
trying 536
through 537
closet 538
twice 539
clothes 540
racks 541
meant 542
handle. 543
woman 544
works 545
However, 546
mother 547
bought 548
fabric 549
there, 550
same 551
problem: 552
employee 553
taking 554
repeat 555
consideration. 556
brought 557
pillow 558
forms 559
me, 560
doubt 561
exactly 562
how 563
large 564
were. 565
My 566
make 567
her 568
project 569
work, 570
short. 571
pillows 572
made, 573
realized 574
short, 575
returned 576
(all 577
sold 578
out, 579
plans 580
making 581
number 582
throw 583
pillows. 584
wanted, 585
flexible. 586
What 587
if 588
been 589
an 590
upholstery 591
piece 592
partially 593
Obviously, 594
unacceptable. 595
advise 596
feel 597
free 598
shop 599
here, 600
figure 601
own. 602
times. 603
burger 604
caramelized 605
onions, 606
red 607
wine 608
believe 609
blue 610
first 611
time. 612
It 613
excellent 614
me. 615
hate 616
going 617
bigger 618
head 619
can't 620
even 621
finish 622
of! 623
burgers 624
would 625
myself 626
home. 627
second 628
went 629
limited 630
seasonal 631
offering 632
venison 633
pea 634
shoots, 635
kind 636
reminded 637
me 638
brie, 639
sweet 640
could 641
done 642
overall 643
onion 644
rings 645
possibly 646
best 647
ever. 648
only 649
thing 650
Flip 651
atmosphere 652
layout 653
tables. 654
guess 655
trendy 656
upscale 657
whatever, 658
makes 659
school 660
cafeteria 661
high 662
school. 663
it. 664
long 665
white 666
shoved 667
against 668
uncomfortable 669
modern 670
plastic 671
chairs 672
look 673
loud 674
absorb 675
sound, 676
cafeteria. 677
women 678
children. 679
idea 680
why 681
bring 682
child 683
unless 684
eater. 685
anything 686
plain. 687
Everything 688
menu 689
exotic 690
ingredients. 691
pricy 692
burgers. 693
Earth 694
kids 695
eat. 696
Burger 697
King 698
street. 699
wish 700
give 701
zero 702
call 703
rude. 704
technicians 705
incompetent. 706
doesn't 707
is. 708
overpriced. 709
quoted 710
another 711
actually 712
lock 713
off, 714
total 715
technician 716
twice. 717
He 718
unusual 719
said 720
he 721
Ok. 722
But, 723
failed 724
charged 725
never 726
offered 727
batteries 728
soon 729
nor 730
send 731
else. 732
could, 733
around 734
10 735
hours 736
Usually 737
need 738
off 739
minute. 740
no. 741
$30 742
received. 743
contacted 744
manager, 745
task 746
itself, 747
rightfully 748
technician's 749
later. 750
knew 751
payment. 752
still 753
$30! 754
five-star 755
seen 756
one! 757
owners, 758
met 759
door, 760
Daniel 761
seasoned 762
waiter 763
delicious. 764
restaurant, 765
experience! 766
son 767
recommended 768
his 769
advice. 770
rack 771
lamb 772
wife 773
grouper 774
crab. 775
Save 776
dessert! 777
live 778
Orlando 779
Quickly 780
stopped 781
UFC 782
fight. 783
sat 784
boyfriend 785
parked 786
car. 787
Although 788
packed 789
LOUD, 790
bartender 791
within 792
Prompt 793
smile. 794
When 795
few 796
minutes 797
later, 798
didn't 799
behind 800
tried 801
flag 802
male 803
coworker. 804
caught 805
watching 806
fight 807
attention 808
- 809
fine. 810
fine, 811
after 812
beer, 813
stood 814
getting 815
beer 816
held 817
arm 818
shield 819
texting 820
management 821
lol. 822
bartender!! 823
As 824
place, 825
continually 826
scanned 827
people 828
attempting 829
eye 830
contact 831
service. 832
watched 833
(my 834
thirty 835
years 836
beverage 837
experience 838
between 839
us) 840
focused 841
importantly, 842
Give 843
girl 844
loved 845
once 846
keep 847
meaning 848
go 849
(just 850
bit 851
way). 852
fairly 853
group 854
we'd 855
something 856
(back 857
$6 858
everything, 859
looks 860
they've 861
changed 862
now). 863
At 864
chickpea 865
fries, 866
delicious 867
watch 868
fiber 869
sit 870
entire 871
board 872
game. 873
game 874
great, 875
love 876
serve 877
mead 878
(though 879
any 880
12 881
molten 882
lava 883
chocolate 884
cake 885
so, 886
Seriously. 887
topping 888
(other 889
fact 890
put 891
complimentary 892
ice 893
background! 894
That 895
+ 896
games 897
= 898
forever. 899
coffee 900
pastries. 901
Baristas 902
excellent. 903
sooooo 904
lost 905
vacant. 906
Nothing 907
enough. 908
Dorchester, 909
hardly 910
Le's 911
goto 912
Pho 913
5 914
stars 915
donuts. 916
Our 917
family 918
coming 919
Donuts 920
years! 921
Their 922
donuts 923
beat 924
must-try. 925
owned 926
years. 927
kind, 928
folks 929
consistently 930
fresh 931
line 932
croissants 933
fritters 934
love. 935
Subs 936
notice 937
added 938
lunch 939
hot 940
dog, 941
chips 942
drink. 943
surroundings 944
try 945
think 946
rice 947
dishes 948
way 949
Pho's. 950
Also 951
spring 952
rolls. 953
friend 954
haven't 955
viennese 956
absolutely 957
Best 958
station 959
fill 960
opinion. 961
Attendants 962
carry 963
bio 964
diesel! 965
Been 966
running 967
Dodge 968
w/o 969
issues. 970
With 971
Safeway 972
corner, 973
rewards 974
favorite 975
gas 976
stop. 977
Thanks! 978
Ordered 979
original 980
tonkotsu 981
base 982
ramen 983
char 984
don 985
2 986
year 987
Loved 988
soup 989
especially 990
bowl 991
reflected 992
quantity 993
content 994
Totally 995
forward 996
customize 997
select 998
thicker 999
noodle 1000
sure 1001
perhaps 1002
add 1003
ramen! 1004
Fabulous 1005
sign 1006
advising 1007
ppl 1008
in, 1009
write 1010
name 1011
then 1012
wait 1013
outside, 1014
clog 1015
won't 1016
larger 1017
ppl. 1018
Heads 1019
up, 1020
chair. 1021
lasik 1022
week 1023
happy 1024
results. 1025
extremely 1026
nice, 1027
remembered 1028
friend, 1029
generally 1030
made 1031
comfortable. 1032
Saturday 1033
appointments. 1034
places, 1035
complementary 1036
followup 1037
exams 1038
treatments 1039
included. 1040
These 1041
minutes. 1042
paperwork 1043
details, 1044
etc 1045
30 1046
surgery 1047
(both 1048
25 1049
drops 1050
pain, 1051
intense 1052
feeling 1053
pressure 1054
holds 1055
still. 1056
hated 1057
that. 1058
pain 1059
experienced 1060
similar 1061
soap 1062
eye, 1063
home 1064
slept 1065
night 1066
woke 1067
morning 1068
see! 1069
And 1070
broken 1071
hold 1072
week, 1073
dry 1074
eyes. 1075
must 1076
avoid 1077
makeup, 1078
sleep 1079
(so 1080
rub 1081
apply 1082
constantly. 1083
FOREVER! 1084
:-) 1085
complaint 1086
help 1087
relax 1088
during 1089
(and 1090
maybe 1091
nervous 1092
started, 1093
panic 1094
hit 1095
open 1096
asked 1097
Oh, 1098
charge 1099
per 1100
Almost 1101
dingy 1102
That's 1103
star. 1104
menu. 1105
3 1106
Saturdays 1107
$2 1108
more) 1109
soup. 1110
dish 1111
mine 1112
Asked 1113
water 1114
times 1115
until 1116
bill 1117
came. 1118
stars! 1119
wanted 1120
since 1121
waitress 1122
stepped 1123
up. 1124
excuse 1125
mediocre 1126
food. 1127
1 1128
hour 1129
massage 1130
tonight 1131
had, 1132
gotten 1133
plenty 1134
massages 1135
First 1136
let 1137
say 1138
asks 1139
simple 1140
questions, 1141
follows 1142
please. 1143
request 1144
totally 1145
opposite. 1146
foot 1147
salt 1148
scrub 1149
due 1150
scheduling 1151
issue, 1152
bad! 1153
company 1154
offers 1155
addition 1156
mistake 1157
part, 1158
take 1159
it! 1160
apologizing 1161
Awesome 1162
on! 1163
Cannot 1164
book 1165
her! 1166
Coco 1167
greeted 1168
checked 1169
process 1170
slightly 1171
awkward 1172
appeared 1173
training, 1174
happen 1175
No 1176
harm 1177
foul. 1178
foul 1179
part 1180
entered 1181
room. 1182
carpet 1183
soggy 1184
bathroom 1185
musty 1186
smell. 1187
Something 1188
along 1189
lines 1190
shouldn't 1191
done, 1192
sucker 1193
opportunity 1194
sticking 1195
work. 1196
desk. 1197
spray 1198
bottle 1199
She 1200
agreed 1201
needed 1202
cleaned 1203
(which 1204
following 1205
day), 1206
assume 1207
stuff? 1208
clearly 1209
point 1210
means 1211
sort 1212
communication. 1213
Long 1214
story 1215
carpet, 1216
walls, 1217
bottle, 1218
coughing 1219
fumes 1220
forced 1221
spend 1222
door 1223
weak 1224
attempt 1225
heart 1226
donated 1227
portion 1228
lung 1229
tissue. 1230
You're 1231
alive. 1232
doubtful 1233
will 1234
coco 1235
key. 1236
Erika 1237
amazing! 1238
months 1239
own, 1240
swooped 1241
weeks! 1242
couldn't 1243
grateful! 1244
thanks 1245
Erika! 1246
truly 1247
hidden 1248
gem 1249
walk 1250
Chinese 1251
small, 1252
cozy, 1253
charming 1254
inside. 1255
might 1256
north 1257
end. 1258
servers 1259
pronouncing 1260
specials 1261
Make 1262
reservation 1263
does 1264
rather 1265
quickly. 1266
Am 1267
crazy 1268
giving 1269
stars? 1270
Maybe. 1271
public 1272
transit 1273
services 1274
US 1275
no, 1276
candle 1277
Japan 1278
Metro 1279
Paris. 1280
But 1281
those 1282
simply 1283
case 1284
anywhere 1285
US. 1286
Simply 1287
T 1288
night, 1289
cleaner 1290
NYC. 1291
Sure, 1292
fast, 1293
Boston's 1294
nearly 1295
big 1296
NYC, 1297
fast 1298
Compared 1299
US, 1300
awesome. 1301
MBTA 1302
-- 1303
stops 1304
showing 1305
signs 1306
debt 1307
billion 1308
dollars. 1309
So 1310
they're 1311
fancy 1312
features 1313
serious 1314
money 1315
pay 1316
knowing 1317
this, 1318
line. 1319
3.5 1320
avocado 1321
margarita 1322
delicious! 1323
Customer 1324
OK, 1325
busy. 1326
meat 1327
wasn't 1328
overly 1329
salty. 1330
return!!! 1331
else 1332
truck 1333
needs 1334
on. 1335
Right 1336
lacking 1337
day 1338
Miguel 1339
crew 1340
turned 1341
guys 1342
gave 1343
advice 1344
pitch 1345
anything, 1346
tire 1347
way. 1348
stands 1349
oil 1350
change, 1351
future. 1352
Thanks 1353
appreciate 1354
ale 1355
house. 1356
star 1357
isn't 1358
management. 1359
You 1360
respect 1361
opened 1362
numerous 1363
finals 1364
tournaments 1365
shown 1366
capacity. 1367
shame 1368
establishment 1369
employees. 1370
pleasant 1371
According 1372
server, 1373
short 1374
staff. 1375
slow. 1376
receiving 1377
Most 1378
good, 1379
except 1380
tough. 1381
seen. 1382
okay. 1383
"A 1384
Bit 1385
start 1386
update, 1387
saying 1388
intention 1389
NOT 1390
Yes, 1391
doing 1392
Eat 1393
On 1394
Yelper 1395
fully 1396
aware 1397
want 1398
$5 1399
Mystery 1400
Monday 1401
gravy 1402
egg 1403
looked 1404
saw 1405
James 1406
Emily 1407
orders, 1408
all) 1409
land 1410
given 1411
sound 1412
resist, 1413
Bad. 1414
BAD. 1415
Slow. 1416
Lauren 1417
S. 1418
noted, 1419
refills 1420
water, 1421
plus 1422
drinks 1423
slow 1424
grits 1425
side 1426
fries 1427
either 1428
forgotten 1429
(the 1430
delayed 1431
Then, 1432
cash 1433
separate 1434
together, 1435
ask 1436
corrected 1437
20% 1438
"service 1439
charge" 1440
kinda 1441
grew 1442
filtered 1443
nowhere 1444
mention 1445
"big 1446
Besides, 1447
everyone 1448
table 1449
goes 1450
lot 1451
least 1452
talked 1453
Ron 1454
we're 1455
gonna 1456
tip 1457
special, 1458
M. 1459
stiff 1460
Still, 1461
three 1462
companions 1463
bad 1464
rest 1465
ready 1466
a) 1467
server 1468
b) 1469
straw 1470
dropped 1471
to-go 1472
box 1473
floor, 1474
picked 1475
it, 1476
happened. 1477
waiting 1478
eating 1479
wings 1480
(as 1481
Yeah, 1482
BAD 1483
finally 1484
spoke 1485
him 1486
and, 1487
stated 1488
him, 1489
should 1490
remove 1491
he'd 1492
included 1493
it." 1494
A 1495
"a 1496
diner 1497
wants 1498
reason, 1499
or, 1500
really, 1501
ever, 1502
gracious 1503
gesture 1504
management's 1505
part. 1506
over, 1507
felt, 1508
well, 1509
Daddy 1510
hear 1511
things, 1512
suddenly 1513
felt 1514
speaking 1515
care, 1516
noted 1517
worked 1518
90 1519
you're 1520
owner, 1521
right? 1522
resto 1523
business 1524
close 1525
easy 1526
justify 1527
"I 1528
Well, 1529
happen. 1530
Honestly, 1531
seemed 1532
Especially 1533
Bloody 1534
Mary's 1535
noting 1536
everyone's 1537
came, 1538
despite 1539
too 1540
much. 1541
awkwardly 1542
(not 1543
James, 1544
pay, 1545
including 1546
eat, 1547
weird, 1548
Monday. 1549
chalk 1550
Rosebud 1551
continue 1552
often 1553
recommending 1554
folks, 1555
-and 1556
chinese 1557
take-out 1558
Portland. 1559
Don't 1560
vibe 1561
scare 1562
away. 1563
WE 1564
LOVE 1565
HAPPY 1566
Just 1567
thinking 1568
now. 1569
prices. 1570
Here's 1571
favorites 1572
General 1573
Tso's 1574
spicy), 1575
crab 1576
puffs, 1577
cheap 1578
drinks, 1579
waiting, 1580
bartenders. 1581
Interesting 1582
watching, 1583
today. 1584
Krog 1585
Street, 1586
figured 1587
shot 1588
VERY 1589
(about 1590
mean 1591
waited, 1592
waited 1593
20 1594
co-workers 1595
Fred's 1596
finished 1597
table. 1598
stuck 1599
though. 1600
counter 1601
Maybe 1602
weeks 1603
basically 1604
burrito 1605
Mediterranean 1606
pita 1607
Shawarma 1608
($8) 1609
pricey 1610
considering 1611
smallest 1612
size. 1613
One 1614
tortilla 1615
$14. 1616
steep 1617
vs 1618
$6.50 1619
$7. 1620
loading 1621
though 1622
lots 1623
sauces 1624
wise, 1625
tasted 1626
great. 1627
Service 1628
terrible! 1629
having 1630
food, 1631
Overall 1632
Recommendation: 1633
chicken, 1634
out. 1635
Be 1636
Flying 1637
Biscuit 1638
Mary 1639
adjust 1640
expectations 1641
decor 1642
husband 1643
South 1644
ate 1645
Atlanta, 1646
Busy 1647
Bee 1648
Cafe 1649
ranked 1650
#1 1651
Pros 1652
FRIED 1653
CHICKEN 1654
EVER 1655
crispy 1656
skin 1657
flavor. 1658
seriously 1659
eat 1660
Boston 1661
Ribs 1662
smokey 1663
taste 1664
Super 1665
mac 1666
n' 1667
Dang 1668
corn 1669
muffins 1670
munch 1671
arrives. 1672
Cons 1673
Very 1674
prepared 1675
worth 1676
it) 1677
air 1678
conditioning 1679
end 1680
June 1681
fans 1682
going, 1683
warm. 1684
Sweet 1685
tea 1686
There's 1687
parking 1688
street 1689
parking. 1690
park 1691
street, 1692
hour. 1693
pizza 1694
street! 1695
i've 1696
birthday 1697
party 1698
disappointed. 1699
thick, 1700
varieties, 1701
i 1702
meatball 1703
too! 1704
cream. 1705
value 1706
comfort 1707
family. 1708
sad 1709
learn 1710
demolishing 1711
this. 1712
Always 1713
seeing 1714
graffiti 1715
art 1716
Had 1717
today 1718
breakfast. 1719
min 1720
French 1721
toast 1722
pulled 1723
grosse 1724
hair 1725
again! 1726
impressed. 1727
dinner 1728
specialty. 1729
burger. 1730
buns 1731
desired. 1732
okay 1733
cold. 1734
$10 1735
soon. 1736
Incredible 1737
Sometimes 1738
early 1739
disappoint. 1740
New 1741
owner 1742
raising 1743
designer 1744
womens 1745
clothing. 1746
Kudos 1747
change 1748
franchise 1749
found 1750
Toyota 1751
leaking 1752
day. 1753
kinds 1754
reasons 1755
weren't 1756
fault. 1757
car 1758
wrong 1759
type 1760
Bravo! 1761
faced 1762
evidence 1763
refund 1764
requested. 1765
indoor 1766
theater 1767
popcorn 1768
touch 1769
:D 1770
Dont 1771
bother 1772
voodoo, 1773
instead. 1774
unique 1775
flavors 1776
fresh. 1777
cold 1778
brew 1779
Bummer. 1780
haddock 1781
sandwich 1782
fries. 1783
frozen 1784
greasy.. 1785
Tasted 1786
fishy 1787
frozen. 1788
hopes 1789
mainly 1790
Instagram 1791
addict's 1792
Believe 1793
ok, 1794
hype 1795
dont 1796
hospitable 1797
luke 1798
oily. 1799
returning. 1800
social 1801
group. 1802
yesterday 1803
ten 1804
deal, 1805
newest 1806
Kendall 1807
Square 1808
"new" 1809
factor 1810
State 1811
Park 1812
delivers 1813
wait! 1814
somehow 1815
crowded 1816
southern 1817
tenders 1818
kept 1819
Juke 1820
Box 1821
tunes, 1822
fun 1823
shuffle 1824
ingredients 1825
fueled 1826
female 1827
Moscow 1828
Mules 1829
dirty 1830
Vodka 1831
Martini. 1832
delicious, 1833
classy 1834
Square. 1835
hopping 1836
Inman 1837
save 1838
yourself 1839
Central 1840
crash 1841
Park. 1842
past, 1843
today, 1844
failure 1845
multiple 1846
levels. 1847
First, 1848
initially 1849
order. 1850
chase 1851
check. 1852
Finally, 1853
check, 1854
pricing 1855
lunch. 1856
office, 1857
paid 1858
said, 1859
inexcusable. 1860
corrective 1861
action, 1862
whether 1863
coaching 1864
staff, 1865
hiring 1866
rush. 1867
everything-I 1868
Dogfish 1869
120m 1870
IPA! 1871
back. 1872
Brasserie 1873
hoping 1874
based 1875
highly 1876
disappointed 1877
quality 1878
escargot 1879
artichoke 1880
start. 1881
Escargot 1882
covered 1883
bitter 1884
green 1885
butter 1886
helped. 1887
cooked 1888
properly 1889
minimally 1890
seasoned. 1891
portions, 1892
fourth 1893
Even 1894
sending 1895
tough 1896
cooked. 1897
chops 1898
main 1899
mashed 1900
potatoes. 1901
potatoes 1902
sour 1903
expected. 1904
For 1905
$35 1906
mustard 1907
accompanying 1908
vegetables 1909
tasteless 1910
again, 1911
disappointing. 1912
ambiance 1913
yummy 1914
creme 1915
brûlée 1916
celebrating 1917
wished 1918
lived 1919
hype. 1920
Bummer 1921
ticket 1922
rental 1923
ok 1924
ride 1925
catch 1926
shuttle. 1927
traveled 1928
light. 1929
learned 1930
shared 1931
parmesan 1932
plentiful. 1933
Two 1934
share. 1935
vegetarian 1936
La 1937
suggested 1938
goodnight 1939
veggie 1940
patty. 1941
sounded 1942
opted 1943
all, 1944
visit 1945
Hopdoddy 1946
would. 1947
Despite 1948
bland. 1949
patty 1950
flavor 1951
sauce. 1952
burger, 1953
Since 1954
sauce, 1955
sell 1956
note 1957
Impossible 1958
miss 1959
meat. 1960
Because 1961
tries 1962
replicate 1963
texture 1964
meat, 1965
off. 1966
classic 1967
cheese. 1968
(no 1969
bacon). 1970
alright 1971
rave 1972
told 1973
banana 1974
shake 1975
feature 1976
items. 1977
expect 1978
shake. 1979
temperature 1980
thin 1981
consistency. 1982
back? 1983
shot. 1984
quick 1985
line: 1986
Once 1987
inside, 1988
spots 1989
invited 1990
there. 1991
jumped 1992
saved 1993
mad 1994
Captain 1995
touched 1996
Starbuck's 1997
drive-thru 1998
jammed 1999
vehicles 2000
window. 2001
friendly! 2002
More 2003
hello 2004
ordered. 2005
busy, 2006
genuinely 2007
smiling. 2008
enjoy 2009
friendliest 2010
Starbucks 2011
visited. 2012
building 2013
pleasing 2014
catches 2015
every 2016
driven 2017
freeway 2018
entrance 2019
regular 2020
stop 2021
Sunday 2022
afternoon 2023
gluten 2024
pizzas 2025
uniquely 2026
fantastic 2027
Will 2028
doing. 2029
car, 2030
go. 2031
assistance. 2032
Upon 2033
arriving 2034
National 2035
garage 2036
anyone 2037
attendant 2038
booth 2039
proceeded 2040
(I 2041
Emerald's 2042
Club 2043
member 2044
caveat 2045
seat 2046
reserved 2047
one. 2048
inside 2049
chosen 2050
vehicle 2051
located 2052
outdoors 2053
seat. 2054
Still 2055
back, 2056
personal 2057
seat, 2058
pointed 2059
pile 2060
seats 2061
shelf 2062
walked 2063
Forget 2064
installation. 2065
Can 2066
tricky 2067
unfamiliar 2068
toddler 2069
crawling 2070
FL 2071
breeze, 2072
proceed 2073
designated 2074
lane 2075
grab 2076
stuff 2077
rep 2078
hand 2079
receipt 2080
terminal. 2081
$50 2082
people) 2083
so-so 2084
AWFUL. 2085
us. 2086
sitting 2087
while, 2088
barely 2089
film 2090
formed 2091
top 2092
ravioli. 2093
Overall, 2094
unimpressed 2095
friend. 2096
Amazing 2097
professional 2098
& 2099
courteous 2100
staff!! 2101
deliver 2102
keeping 2103
word 2104
helping 2105
Stephen 2106
provided 2107
:) 2108
Thank 2109
awesome!!! 2110
Seriously, 2111
aren't 2112
Tonight 2113
occasion, 2114
new. 2115
Yelp 2116
led 2117
Watertown 2118
hard 2119
yet. 2120
To 2121
Persian 2122
below 2123
stairs. 2124
(with 2125
opens 2126
lovely, 2127
ceiling 2128
exposed 2129
brick 2130
adorned 2131
gold 2132
threaded 2133
ones 2134
served 2135
attentive. 2136
cared 2137
enjoyed 2138
guy. 2139
cheese, 2140
rich, 2141
flavorful 2142
wonderful. 2143
beans 2144
accompanied 2145
well. 2146
buffalo 2147
salad. 2148
latter, 2149
impressed 2150
was. 2151
wings, 2152
says 2153
he's 2154
Buffalo 2155
impossible 2156
please 2157
these 2158
things. 2159
sample 2160
gorgonzola 2161
confirmed 2162
(including 2163
dressing) 2164
site. 2165
lot, 2166
I'd 2167
thank 2168
leaving 2169
sugar 2170
martini 2171
glass. 2172
Sugar 2173
unnecessary 2174
set 2175
sticky 2176
training 2177
wheels. 2178
Three 2179
cheers 2180
decent 2181
lemon 2182
martini. 2183
tonight. 2184
wrong, 2185
privacy 2186
quiet 2187
room, 2188
tells 2189
Comfort 2190
remain 2191
secret. 2192
Get 2193
thee 2194
yumminess. 2195
Fix 2196
Beer. 2197
hardware 2198
problem. 2199
15 2200
45 2201
taps 2202
faulty. 2203
Sorry 2204
guys, 2205
notice, 2206
Please 2207
Scott. 2208
hut 2209
i'v 2210
florida 2211
welcome 2212
children 2213
certainly 2214
ambiance. 2215
appears 2216
cream 2217
window 2218
front, 2219
curtains. 2220
efficient, 2221
stick 2222
curries 2223
tufts 2224
students 2225
year, 2226
b/c 2227
accommodate 2228
groups. 2229
sometimes 2230
employees 2231
electronic 2232
keyboard. 2233
trouble 2234
deciding 2235
certain 2236
five 2237
star, 2238
meh. 2239
props 2240
using 2241
consensus 2242
improve 2243
read 2244
ago 2245
online, 2246
curious 2247
productive 2248
study 2249
session, 2250
tempting, 2251
dying 2252
chile 2253
burrito, 2254
that's 2255
lunch, 2256
guy 2257
$8 2258
assumed 2259
toppings 2260
cost, 2261
extra, 2262
longer 2263
written 2264
online. 2265
roasted 2266
shrimp 2267
quesadilla 2268
his. 2269
minor 2270
bothered 2271
counter, 2272
supposed 2273
anywhere, 2274
surely 2275
counter. 2276
"meh" 2277
salsa 2278
table, 2279
special. 2280
greasy 2281
salsas 2282
expecting 2283
tomatillo 2284
amazing, 2285
Instead, 2286
lime 2287
juice 2288
cannot 2289
remember 2290
single 2291
salsa, 2292
sign, 2293
ago. 2294
though, 2295
AMAZING. 2296
parts 2297
nicely 2298
potatoes, 2299
blend 2300
Pinto 2301
cooked, 2302
meh 2303
corn, 2304
breaker 2305
ample 2306
parking, 2307
space 2308
homework 2309
improving 2310
can. 2311
are, 2312
roommate 2313
clock 2314
radio 2315
apparently 2316
station. 2317
wake 2318
normal 2319
7 2320
a.m. 2321
alarm 2322
hearing 2323
god 2324
awful 2325
named 2326
literally 2327
honestly 2328
across 2329
face 2330
listen 2331
douche 2332
yelling 2333
show 2334
bit. 2335
hosts 2336
identify 2337
Bon 2338
song 2339
Are 2340
kidding 2341
me? 2342
Where 2343
hell 2344
wherever 2345
required 2346
speak 2347
matter. 2348
dial 2349
establishments 2350
west 2351
coast 2352
yelp 2353
east 2354
coast. 2355
fascinating 2356
passionate 2357
whomever 2358
genius. 2359
Fresh 2360
brunch 2361
infused 2362
awesome 2363
buttermilk 2364
biscuits. 2365
"roll 2366
cakes 2367
scramble 2368
sausage 2369
gross 2370
grease 2371
topped 2372
mushroom 2373
rosemary 2374
gravy. 2375
Personally, 2376
hands 2377
tried. 2378
licked 2379
plate 2380
finished. 2381
shocked 2382
lack 2383
usual 2384
foods 2385
Lastly, 2386
biscuit 2387
heaven 2388
baked 2389
oven 2390
Take 2391
savor 2392
up! 2393
Perfect 2394
spices, 2395
music, 2396
lighting 2397
decor. 2398
restroom 2399
cool. 2400
again. 2401
Was 2402
mins 2403
drink 2404
done. 2405
taken. 2406
waiters. 2407
Appetizers 2408
5-10 2409
other. 2410
rolls 2411
Sushi 2412
quality. 2413
enjoying 2414
spent 2415
waiting. 2416
grilled 2417
takes 2418
make. 2419
something? 2420
Who 2421
knows. 2422
amount 2423
slow, 2424
trays 2425
people, 2426
resulted 2427
runs 2428
bar. 2429
Which 2430
understandable 2431
TOTALLY 2432
sense 2433
serving 2434
restaurant. 2435
mean, 2436
restaurant? 2437
imagine. 2438
alcohol 2439
Too 2440
foreign 2441
concept. 2442
classiest 2443
downtown, 2444
cut 2445
borderline 2446
Thursday 2447
hung 2448
previous 2449
location, 2450
bubble 2451
tea, 2452
however. 2453
barista 2454
10-15 2455
tea... 2456
amazing 2457
Elizabeth 2458
She's 2459
March 2460
2016. 2461
she's 2462
cheap!! 2463
instructors 2464
ensure 2465
perfection. 2466
curly 2467
listening 2468
concerns 2469
understanding 2470
style 2471
hair. 2472
plan 2473
facials 2474
month. 2475
German 2476
Village, 2477
Cup 2478
o 2479
Joe 2480
chain, 2481
dessert 2482
there's 2483
taste. 2484
casual, 2485
comfortable, 2486
relaxing. 2487
Free 2488
WiFi 2489
Book 2490
business, 2491
Falafel 2492
wrap 2493
falafel 2494
greens, 2495
pickles, 2496
hummus 2497
wrap. 2498
wonder 2499
low. 2500
checking 2501
pressed 2502
crunch 2503
soft 2504
chew. 2505
falafels 2506
bland 2507
bite 2508
same, 2509
wraps 2510
evenly 2511
far 2512
stuffing 2513
person, 2514
suggest 2515
specialty 2516
rodeo 2517
pour 2518
grinder, 2519
espresso 2520
machine 2521
likely 2522
annoyed 2523
baristas 2524
talk 2525
you've 2526
heard 2527
serves 2528
coffee. 2529
coffee, 2530
Im 2531
roaster 2532
George 2533
legend 2534
impressive. 2535
Ethiopian 2536
instead 2537
action. 2538
$4 2539
opinion 2540
Next 2541
use 2542
drinking 2543
was, 2544
switching 2545
more. 2546
decided 2547
elsewhere 2548
supporting 2549
roasters 2550
starting 2551
George, 2552
ya 2553
down. 2554
Called 2555
flowers 2556
phone 2557
arrangement 2558
delivered. 2559
indication, 2560
seated 2561
rudely 2562
host 2563
fought 2564
Finally 2565
server's 2566
section, 2567
treated 2568
crap 2569
Cheap 2570
guess. 2571
unremarkable 2572
(good 2573
Sometimes, 2574
crave 2575
coke. 2576
PDX 2577
Sliders 2578
delivered 2579
sliders 2580
inches 2581
packs 2582
satisfying. 2583
sister 2584
Morrison 2585
pesto, 2586
baby 2587
arugula, 2588
aioli 2589
two, 2590
Sellwood 2591
her. 2592
consisted 2593
beef, 2594
patty, 2595
aged 2596
lettuce, 2597
Hawthorne 2598
goat 2599
strawberry 2600
Of 2601
course, 2602
share 2603
Hawthorne. 2604
sweetness 2605
tang 2606
complimented 2607
could've 2608
typical 2609
flavors. 2610
Love 2611
truffle 2612
crispy! 2613
While 2614
benches 2615
eating, 2616
weird 2617
constantly 2618
walking 2619
area. 2620
Beaverton 2621
time, 2622
blown 2623
away 2624
We've 2625
salesman 2626
Mo 2627
Drew 2628
(can't 2629
forget 2630
Josh 2631
( 2632
Sales 2633
Manager 2634
Each 2635
we've 2636
presented 2637
challenges 2638
to, 2639
negative 2640
involved, 2641
payment 2642
have. 2643
matter 2644
requests 2645
welcomed 2646
beyond 2647
customer. 2648
example: 2649
Subaru 2650
dealership 2651
wouldn't 2652
numbers 2653
asking 2654
shock 2655
awe 2656
went. 2657
convince 2658
challenge 2659
attitudes 2660
sales 2661
jobs, 2662
pushy 2663
annoying, 2664
HATE 2665
buying 2666
(despite 2667
traded 2668
express 2669
YOU 2670
safety 2671
important 2672
patient 2673
easiest 2674
respectful, 2675
professional, 2676
relaxed. 2677
issue 2678
purchasing 2679
rare), 2680
rice! 2681
brag 2682
know. 2683
deserve 2684
Toyota. 2685
think, 2686
cars 2687
years, 2688
recently, 2689
shopping. 2690
decide 2691
gorgeous 2692
! 2693
dine 2694
world 2695
Wow 2696
impressed, 2697
Animal 2698
kingdom 2699
adding 2700
gem. 2701
Avatar 2702
(pandora 2703
) 2704
May, 2705
Brookline 2706
16 2707
girls 2708
who've 2709
owners 2710
coworker 2711
polite 2712
reasonable 2713
Maria's 2714
flower 2715
arrangements. 2716
go-to 2717
day! 2718
variety 2719
endless 2720
team 2721
item 2722
yet, 2723
fresh, 2724
healthy, 2725
easy. 2726
Tip: 2727
Anytime 2728
(instead 2729
work) 2730
heat 2731
skillet 2732
tasty, 2733
AND 2734
feels 2735
Jacks 2736
be. 2737
exceptional, 2738
calzones! 2739
Or 2740
funky 2741
slice 2742
creations 2743
(hotdog 2744
ect)! 2745
atmosphere. 2746
During 2747
thing. 2748
Mexican 2749
NY. 2750
cheap, 2751
surprisingly 2752
wide 2753
dinners 2754
combination 2755
specials, 2756
common 2757
traditional 2758
restaurants. 2759
town 2760
Parking 2761
bad, 2762
immediately 2763
available. 2764
Unfortunately 2765
communication 2766
errors 2767
waitresses 2768
clear 2769
placing 2770
hits 2771
spot. 2772
ended 2773
needing 2774
root 2775
canal 2776
diagnosis 2777
Dr. 2778
chair 2779
stating 2780
it'll 2781
cost 2782
$1400 2783
ive 2784
reached 2785
cap 2786
insurance. 2787
afford 2788
im 2789
wow 2790
Being 2791
desperate 2792
scared 2793
signed 2794
agreement. 2795
dentist 2796
chart, 2797
ahead 2798
$300 2799
treatment. 2800
talking 2801
insurance 2802
complete 2803
treatment 2804
(better 2805
treats 2806
scum. 2807
Bethany 2808
dental 2809
situation. 2810
contacts 2811
explaining 2812
$800 2813
(it 2814
hadn't 2815
blocked 2816
email 2817
"we 2818
chamber 2819
stupid 2820
Google 2821
exists 2822
honey 2823
consists 2824
steps 2825
cleaning 2826
roots. 2827
that, 2828
else! 2829
Before 2830
expensive 2831
procedure 2832
rush 2833
wise 2834
they'll 2835
billing 2836
completed 2837
outrageous 2838
costs. 2839
DC 2840
tried) 2841
runner 2842
Wednesday 2843
immediately. 2844
combo 2845
tender, 2846
flavorful. 2847
skip 2848
injera 2849
specifically 2850
colorful 2851
hangout, 2852
unpretentious 2853
cool 2854
cheep 2855
PBR. 2856
Besides 2857
concerts, 2858
nights 2859
"Heroes"(80ies 2860
Party) 2861
"xMortis"(Goth) 2862
Joey 2863
grows 2864
style. 2865
Highly 2866
him! 2867
Might 2868
helpful 2869
buy, 2870
currently 2871
luck 2872
response. 2873
Tuesday 2874
seven 2875
workers 2876
cracked 2877
galaxy 2878
drop 2879
knowledge. 2880
happens 2881
lucky 2882
willing 2883
Immediately 2884
rid 2885
purchased 2886
third 2887
corporate 2888
(had 2889
clue 2890
cancel 2891
contract 2892
it; 2893
hates 2894
customers. 2895
worker 2896
says, 2897
"you 2898
crack 2899
terrible. 2900
obvious 2901
Stay 2902
Chicken 2903
Express 2904
problem, 2905
notch, 2906
squeaky 2907
exterior, 2908
bathrooms, 2909
see. 2910
liver 2911
batch 2912
6 2913
cook. 2914
taken 2915
livers, 2916
cook 2917
arrive. 2918
THAT 2919
exceptional 2920
smart, 2921
hip, 2922
door. 2923
dark 2924
inviting 2925
parties 2926
together 2927
people. 2928
indecisive. 2929
share, 2930
cottage 2931
thickly 2932
sliced 2933
chips. 2934
beet 2935
salad 2936
marinate 2937
beets 2938
juice, 2939
before. 2940
grits, 2941
incredible. 2942
dreamy 2943
poached 2944
egg, 2945
sausage, 2946
expecting. 2947
Do 2948
bok 2949
choy 2950
vegetable 2951
however 2952
lemon. 2953
Nice 2954
Subpar 2955
price. 2956
Unbelievably 2957
rude 2958
hostess 2959
Server, 2960
Dani 2961
stay... 2962
level 2963
unprofessionalism 2964
unpleasant 2965
hostesses 2966
horrible. 2967
low 2968
service... 2969
Austin 2970
recently 2971
searched 2972
fine 2973
website 2974
Yelp. 2975
tacos 2976
upon 2977
ourselves 2978
strip 2979
mall, 2980
fancy. 2981
beyond. 2982
production 2983
basket 2984
salsas, 2985
mouth, 2986
house 2987
ass 2988
quesadillas, 2989
admit 2990
White 2991
Girl 2992
quesadilla. 2993
Granted, 2994
tortillas 2995
tacos. 2996
oh 2997
man, 2998
quesadillas! 2999
like, 3000
heaven. 3001
town. 3002
thankfully 3003
hasn't 3004
changed. 3005
(usually 3006
dish), 3007
noticed 3008
smaller 3009
waitress, 3010
always. 3011
obviously 3012
knows 3013
difference 3014
imagination 3015
choose 3016
three, 3017
double 3018
eggplant 3019
ALWAYS 3020
do). 3021
menu, 3022
appetizer 3023
$1 3024
dollar 3025
exact 3026
items! 3027
arguing 3028
legitimate 3029
charge, 3030
grape 3031
leaves. 3032
whole 3033
mouth. 3034
boycott 3035
brother 3036
law 3037
Orlando, 3038
starving. 3039
Every 3040
dish. 3041
mofongo 3042
de 3043
lacked 3044
typically 3045
(in 3046
oil. 3047
gross. 3048
back!!! 3049
awful. 3050
Scoutmob 3051
act 3052
accept 3053
added. 3054
So, 3055
decent. 3056
shady 3057
mall. 3058
handed 3059
1/2 3060
18% 3061
tax 3062
Let 3063
girlfriend 3064
reviewing 3065
Decor 3066
works. 3067
bbq 3068
joint. 3069
Mission 3070
liked 3071
simplicity 3072
(although 3073
ribs 3074
option 3075
burnt 3076
ends. 3077
ends, 3078
FYI, 3079
ends 3080
Atlanta. 3081
sub 3082
par 3083
1.5 3084
inch 3085
cubes 3086
brisket 3087
black 3088
sides. 3089
Definite 3090
disappointment 3091
sole 3092
Other 3093
lackluster 3094
food: 3095
stew 3096
okay... 3097
undercooked. 3098
okra. 3099
okra, 3100
whenever 3101
okra 3102
meal. 3103
fry 3104
tempura 3105
batter. 3106
They're 3107
smoked 3108
juicy. 3109
shift. 3110
overwhelmed 3111
six 3112
80 3113
dollars 3114
fixed 3115
caused 3116
delay 3117
already 3118
issues 3119
fault, 3120
bartender. 3121
Megan 3122
pad 3123
people's 3124
guessing 3125
putting 3126
you. 3127
discounts 3128
Place 3129
specials. 3130
charging 3131
applied. 3132
watches 3133
staying 3134
trade 3135
show, 3136
gigantic 3137
lobby. 3138
Smiles 3139
faces 3140
dressed 3141
plugs 3142
someone. 3143
provide 3144
hangover 3145
beds 3146
connected 3147
bedroom 3148
kitchen, 3149
living 3150
tub 3151
Starbucks, 3152
plus. 3153
safe 3154
bartenders 3155
directed 3156
vibe. 3157
(Half 3158
chill, 3159
"shoot 3160
pool 3161
organize 3162
squad 3163
trip 3164
friends. 3165
Came 3166
impressed! 3167
wonderful! 3168
Everyone 3169
chef 3170
hi. 3171
duck, 3172
flavorful! 3173
side. 3174
duck 3175
dinner. 3176
provider 3177
list 3178
dermatologist 3179
listed 3180
appointment. 3181
arrived, 3182
Stephanie 3183
doctor, 3184
assistant. 3185
Thought 3186
booked 3187
appointment 3188
listened 3189
concerns. 3190
round 3191
medication 3192
acne 3193
prescription. 3194
$20 3195
actual 3196
doctor. 3197
Took 3198
difference. 3199
office 3200
step 3201
initial 3202
dose 3203
yet 3204
time). 3205
test 3206
levels 3207
down, 3208
nope 3209
changes, 3210
Time 3211
dermatologist. 3212
recommendations 3213
brothers 3214
Society 3215
halal 3216
Street 3217
subway 3218
kabob 3219
dinners, 3220
enjoyable, 3221
pudding 3222
dessert, 3223
free. 3224
touch. 3225
discount 3226
jeans. 3227
selling 3228
anything- 3229
13 3230
old) 3231
lot. 3232
donating 3233
worthy 3234
cause. 3235
Also- 3236
dare 3237
them, 3238
unorganized 3239
Soooo 3240
good! 3241
biscuits, 3242
jelly 3243
biscuits 3244
large, 3245
Up 3246
Austin. 3247
deck 3248
picks 3249
unable 3250
answer 3251
question 3252
tell 3253
hang 3254
hangs 3255
voucher 3256
Johns 3257
Creek 3258
strong 3259
place... 3260
tapas 3261
list... 3262
didnt 3263
cocktails 3264
visit! 3265
classes 3266
NOTHING 3267
priority 3268
class, 3269
(seriously, 3270
week. 3271
fantastic, 3272
supportive, 3273
funny, 3274
positive, 3275
various 3276
skills. 3277
gained 3278
strength 3279
quickly, 3280
biggest 3281
benefit 3282
class 3283
ONLY 3284
mind 3285
100% 3286
present 3287
moment. 3288
practice 3289
life 3290
workout 3291
laughing 3292
class. 3293
therapy 3294
groups 3295
individual 3296
instructors, 3297
support 3298
encourage 3299
new, 3300
challenging 3301
positive 3302
HAVE 3303
visited 3304
Friday, 3305
July 3306
milkshake. 3307
shakes 3308
alcohol. 3309
Grub 3310
modern. 3311
confused 3312
explained 3313
Front 3314
Porch 3315
tomato, 3316
onion, 3317
etc.) 3318
ring 3319
Java 3320
spiked 3321
advertise 3322
hamburger 3323
ground 3324
bun. 3325
milkshake 3326
straw. 3327
Grindhouse 3328
milkshakes 3329
seasoning. 3330
items 3331
joints 3332
Burgers 3333
crawfish 3334
array 3335
signature 3336
drinks. 3337
Atlanta 3338
coworkers 3339
owns 3340
Italian 3341
joint, 3342
whatsoever. 3343
Never 3344
somewhat 3345
pricey. 3346
decor, 3347
outside 3348
smoke, 3349
colored 3350
lights, 3351
hats 3352
walls 3353
onto 3354
children's 3355
faster 3356
music 3357
Again, 3358
unique. 3359
Has 3360
character 3361
craving 3362
Italian, 3363
revisit. 3364
unfortunately 3365
others 3366
level, 3367
waitstaff 3368
grabbing 3369
conversation 3370
own 3371
conversation. 3372
Well 3373
is, 3374
regularly 3375
OG 3376
much, 3377
ending 3378
bowl, 3379
priced 3380
refills. 3381
Mushroom 3382
pieces 3383
refill 3384
placed 3385
plate, 3386
removed 3387
shopping 3388
Newbury 3389
st. 3390
hours, 3391
sushi 3392
, 3393
miso 3394
men 3395
forever 3396
i'm 3397
xo 3398
terrible 3399
Shaking 3400
Crab 3401
Quincy. 3402
crackers 3403
washer 3404
minute 3405
two. 3406
more, 3407
missing. 3408
cracker. 3409
avoided 3410
informed 3411
care. 3412
normally 3413
post 3414
could. 3415
Realize 3416
cafe 3417
local 3418
surprise. 3419
Lots 3420
tons 3421
boot. 3422
scratch. 3423
Simple 3424
Urban 3425
open. 3426
disappoint! 3427
schnitzel 3428
out! 3429
Bridge 3430
views 3431
top! 3432
St 3433
Bobby. 3434
executed 3435
flawlessly. 3436
honest 3437
jiffy 3438
lube, 3439
tires 3440
man 3441
Stopped 3442
pleasantly 3443
surprised! 3444
bread, 3445
lovers 3446
flatbread 3447
piccata. 3448
Italy. 3449
sure! 3450
gooey 3451
boiled 3452
eggs 3453
you'd 3454
eggs! 3455
meals, 3456
unremarkable. 3457
Extremely 3458
regret 3459
wasting 3460
money, 3461
calories. 3462
Voodoo 3463
Donut 3464
donut 3465
airy 3466
bitten 3467
once, 3468
lot! 3469
Worst 3470
... 3471
wife's 3472
theme 3473
parks 3474
fond 3475
indo 3476
cuisine 3477
Pulled 3478
advertised 3479
.... 3480
disappointing 3481
experiance 3482
.. 3483
f'ing 3484
justified 3485
suggesting 3486
dined 3487
therefore 3488
weekend, 3489
Went 3490
killing 3491
profit. 3492
appetizers 3493
(we 3494
contained 3495
c 3496
(what 3497
suppose 3498
salad, 3499
$10.75 3500
protein 3501
basic 3502
sized 3503
cous 3504
olives, 3505
tomato 3506
cucumber. 3507
flawlessly 3508
beautifully. 3509
Minus 3510
seemingly 3511
rushed 3512
breezed 3513
description 3514
dishes. 3515
(Had 3516
14 3517
course 3518
pairing.) 3519
Legal 3520
Seafood 3521
dedication 3522
EVER. 3523
roll 3524
buttered 3525
light 3526
Really 3527
crabmeat. 3528
salads 3529
terrific 3530
servers. 3531
Warm, 3532
attentive 3533
trust 3534
me- 3535
you'll 3536
chance 3537
get! 3538
Plenty 3539
jalapeno 3540
cornbread 3541
Mac 3542
n 3543
moist 3544
moist, 3545
fatty, 3546
alot 3547
ill 3548
homeless 3549
guitar 3550
singing 3551
bc 3552
drunk 3553
ruined 3554
us.. 3555
gimmicky 3556
tasty) 3557
waffles. 3558
spicy 3559
fire 3560
WAY 3561
applied 3562
forgetful 3563
place! 3564
menus 3565
creative, 3566
Pumpkin 3567
Martini 3568
(ask 3569
cinnamon 3570
Pie 3571
amazing. 3572
lengthy 3573
concerned, 3574
portion, 3575
share). 3576
phenomenal. 3577
poor 3578
once. 3579
attitude 3580
detour 3581
option. 3582
breakdown 3583
hour: 3584
entries 3585
elevator 3586
$22 3587
pours 3588
generous 3589
putt 3590
sub-par 3591
(pun 3592
intended) 3593
card 3594
quarter 3595
Total 3596
half. 3597
thanks. 3598
investment 3599
lower 3600
prices, 3601
one-time 3602
visit. 3603
Boston. 3604
say. 3605
Though 3606
average 3607
semi 3608
private 3609
concert 3610
attended 3611
raised 3612
2. 3613
pride 3614
funny 3615
bone 3616
usually 3617
team. 3618
costumers 3619
satisfaction 3620
priority. 3621
mission 3622
review 3623
criticism 3624
proper 3625
Wow. 3626
you, 3627
SO 3628
definetely 3629
among 3630
Indian 3631
$26 3632
(chicken 3633
tikka 3634
masala, 3635
platter 3636
chewy 3637
wheat 3638
onions. 3639
Enough 3640
self 3641
silly. 3642
authenticity 3643
Tikka 3644
Masala 3645
bad. 3646
mild 3647
spice 3648
kick. 3649
heavy 3650
bold 3651
Amazing. 3652
delivery 3653
stove 3654
pakora 3655
tasting 3656
taste, 3657
anyway. 3658
polite, 3659
hotpot 3660
mainland. 3661
Price 3662
cooking 3663
full. 3664
Light 3665
firepot 3666
burnaby. 3667
plain 3668
impeccable. 3669
cocktail 3670
vodka. 3671
Cheers!!! 3672
July. 3673
pampering 3674
boy 3675
Wonderful 3676
spa 3677
massage! 3678
service, 3679
priced. 3680
Potstickers 3681
jam 3682
go! 3683
specially 3684
evenings 3685
outer 3686
beautiful 3687
Staff 3688
.food 3689
wait. 3690
Excited 3691
Lavender 3692
coffees 3693
feet 3694
arms 3695
Several 3696
passed 3697
ignoring 3698
coffees. 3699
somebody 3700
completely 3701
bland, 3702
surprised 3703
tasting, 3704
imagined 3705
exception. 3706
waffles 3707
focaccia 3708
price, 3709
Medina 3710
quaint 3711
authentic 3712
Downtown 3713
Austin, 3714
downtown. 3715
spinach 3716
empandas. 3717
types 3718
wines 3719
America. 3720
tenderloin 3721
gnocchi. 3722
LOVED 3723
brulee. 3724
here: 3725
Arroz 3726
con 3727
Bistec 3728
Queso 3729
y 3730
Salami 3731
Frito 3732
app 3733
perfect. 3734
side, 3735
favor 3736
Rice 3737
staple 3738
perfectly. 3739
Sangria 3740
(very 3741
tough, 3742
Yuca 3743
Frita 3744
mozzarella 3745
sticks, 3746
Mofongo 3747
alcoholic 3748
excessively 3749
sugary 3750
Fri 3751
turn 3752
drag 3753
night) 3754
strange 3755
Wow!!! 3756
Absolutely 3757
had!!! 3758
Tried 3759
fashion 3760
glazed, 3761
(favorite!!!) 3762
fritters...and 3763
kidding...BEST 3764
EVER!!! 3765
Dense, 3766
DEEEEE-lightful!!! 3767
area!!! 3768
Yummmmmmm!!! 3769
wireless 3770
spotty 3771
useless. 3772
difficult 3773
posted, 3774
work-related 3775
internet. 3776
depend 3777
reliable 3778
internet 3779
connection. 3780
state 3781
further 3782
effort 3783
fix 3784
issue. 3785
inattentive 3786
(at 3787
minimum 3788
glass 3789
enter 3790
quirky 3791
key 3792
timed 3793
spite 3794
mornings 3795
servings 3796
large! 3797
ladies 3798
(different 3799
lady) 3800
alone 3801
recommended! 3802
bird 3803
according 3804
phrase 3805
decision 3806
6th 3807
St. 3808
parade 3809
6th. 3810
interior 3811
spartan 3812
breezy 3813
detail 3814
presentation 3815
preparation 3816
lobster 3817
appetizer. 3818
cilantro 3819
chipotle 3820
polenta, 3821
enjoyed, 3822
eaten 3823
redfish 3824
ways 3825
spiced 3826
crust 3827
thoroughly 3828
enjoyable. 3829
reccomend 3830
who's 3831
assured 3832
fun. 3833
Try 3834
yourself. 3835
Dime 3836
dozen 3837
lounge 3838
Douche 3839
Ranch. 3840
Meh. 3841
Comfortable 3842
joint 3843
smack 3844
dab 3845
middle 3846
Harvard 3847
Drop 3848
breeze 3849
Fighter 3850
need, 3851
rivals 3852
under 3853
construction. 3854
points 3855
tipped 3856
Tea 3857
Stop 3858
wall) 3859
valuable 3860
Pretty 3861
neighborhood 3862
boring 3863
chain 3864
restaurants 3865
bars 3866
deserves 3867
Rival 3868
grocery 3869
evening 3870
collecting 3871
registers, 3872
register 3873
items, 3874
registers 3875
shirts 3876
standing 3877
Me 3878
bag 3879
groceries 3880
register. 3881
assistance 3882
needed. 3883
elderly 3884
handicap 3885
wheelchair 3886
handle 3887
everything. 3888
encountered 3889
positions 3890
workers. 3891
movie 3892
buff. 3893
Got 3894
Out 3895
Huntington 3896
Northeastern, 3897
"fast 3898
food" 3899
amazing-tasting 3900
burrito. 3901
bowls, 3902
personally. 3903
Point 3904
East 3905
Coast, 3906
EVERYTHING 3907
gets 3908
science. 3909
chick 3910
reps 3911
eventually 3912
fear 3913
themselves 3914
whiskey 3915
| 3916
couch 3917
purse 3918
Imagine 3919
Dunkin 3920
Honda 3921
FREE 3922
THEIR 3923
stuff. 3924
NOW. 3925
elaborate 3926
Winning 3927
fuels 3928
worked. 3929
haggling 3930
life. 3931
soul. 3932
pricing. 3933
Bleh. 3934
#2 3935
Prices 3936
(New 3937
dealership. 3938
photo 3939
cute. 3940
shout 3941
BIG 3942
DEAL!!! 3943
picture 3944
end, 3945
elite 3946
royalty. 3947
finest 3948
whilst 3949
women. 3950
played 3951
Years 3952
Kingdom 3953
what's 3954
integrity 3955
Bunch 3956
Island 3957
Boat 3958
grown 3959
weary 3960
young 3961
bed 3962
Channel 3963
news 3964
juice. 3965
replace 3966
video 3967
trivia 3968
improv 3969
snacks 3970
80's 3971
wonders 3972
beverages 3973
alcoholic) 3974
karaoke. 3975
efficient 3976
entertainment 3977
purchase 3978
fullness 3979
oneself 3980
annual 3981
turkey 3982
wave 3983
keys 3984
luxury 3985
heated 3986
seats, 3987
in. 3988
now... 3989
bottom 3990
Honda. 3991
celebration. 3992
sadly 3993
disco 3994
dancing 3995
showroom 3996
wearing 3997
staircase 3998
catering 3999
hall 4000
wedding 4001
king 4002
missing 4003
pastries 4004
DJ 4005
dance 4006
participate 4007
tad 4008
torn 4009
sneakers 4010
unicorn 4011
cat 4012
t-shirt. 4013
plumbing 4014
fixtures 4015
remodeling 4016
jobs 4017
Yes 4018
miniature 4019
waterfall 4020
bathroom. 4021
do. 4022
Anyway, 4023
dress 4024
nicely. 4025
ranting 4026
hassle 4027
pleasant, 4028
endorse 4029
Portland! 4030
Blue 4031
Star 4032
incredible 4033
sweets 4034
savory 4035
mouth 4036
watering 4037
glorious 4038
tooth. 4039
sure. 4040
Delicious 4041
shirini 4042
(sweets) 4043
napoleans 4044
northeast! 4045
eaten, 4046
Treats 4047
amazingly 4048
homemade 4049
cookie 4050
lover 4051
closest 4052
convenient 4053
abysmal. 4054
Prepare 4055
fatty 4056
brownie 4057
deliciousness 4058
occasions 4059
99% 4060
unaware 4061
chip, 4062
sugar, 4063
Outside 4064
easily 4065
cookies 4066
demand. 4067
milk 4068
desire. 4069
Thaitation 4070
understatement. 4071
Thai 4072
Brown 4073
college. 4074
Fenway 4075
related 4076
fallen 4077
wrong. 4078
convinced 4079
college 4080
be! 4081
Pad 4082
thai, 4083
tofu 4084
mushrooms, 4085
wonton 4086
soup, 4087
mango 4088
days! 4089
meals 4090
steep. 4091
Quality, 4092
for?! 4093
tuna 4094
rolled 4095
guac. 4096
migas 4097
yummy! 4098
daughter 4099
loves 4100
occasions, 4101
mole 4102
SOOO 4103
good!!! 4104
Salsa 4105
too, 4106
fruit 4107
(rice 4108
either. 4109
hip. 4110
traveling 4111
Congress, 4112
diamond 4113
Nueva 4114
Onda 4115
Visited 4116
weekday 4117
friendliness 4118
Caesar 4119
($8 4120
shrimp, 4121
most. 4122
paid. 4123
birthday. 4124
occasion 4125
assortment 4126
scallops, 4127
mussels, 4128
fish 4129
skate 4130
halibut. 4131
impressive 4132
lightly 4133
natural 4134
remarkable. 4135
accidentally 4136
spilled 4137
apologize. 4138
knowledgeable 4139
wine. 4140
pistachio 4141
cream, 4142
baklava, 4143
welcoming. 4144
upset 4145
early. 4146
stayed. 4147
citrus 4148
twist 4149
huge! 4150
Go 4151
brunch. 4152
Orlando. 4153
Excellent 4154
ambience 4155
relax. 4156
dime 4157
whom 4158
Sierra 4159
Door 4160
Living 4161
mine. 4162
dead 4163
palm 4164
irrigation 4165
installation 4166
repair 4167
metal 4168
fencing 4169
at. 4170
referred 4171
Association 4172
report 4173
described. 4174
property 4175
try! 4176
cool! 4177
nightclub 4178
feel. 4179
Music 4180
playing, 4181
older 4182
(wouldn't 4183
families 4184
ok. 4185
location. 4186
sushi. 4187
cup 4188
tea. 4189
preferred 4190
Quality 4191
servce. 4192
value. 4193
Consider 4194
spliting 4195
meail 4196
engae 4197
Gumbo 4198
Check 4199
