Word	ID
<end-document> 0
<end-paragraph> 1
<end-sentence> 2
<unknown> 3
Stayed 4
in 5
a 6
king 7
suite 8
for 9
11 10
nights 11
and 12
yes 13
it 14
us 15
bit 16
but 17
we 18
were 19
happy 20
with 21
the 22
standard 23
of 24
room, 25
location 26
friendliness 27
staff. 28
Our 29
room 30
was 31
on 32
20th 33
floor 34
overlooking 35
Broadway 36
madhouse 37
Fairway 38
Market. 39
Room 40
quite 41
no 42
noise 43
evident 44
from 45
hallway 46
or 47
adjoining 48
rooms. 49
It 50
great 51
to 52
be 53
able 54
open 55
windows 56
when 57
fresh 58
rather 59
than 60
heated 61
air. 62
The 63
beds, 64
including 65
fold 66
out 67
sofa 68
bed, 69
comfortable 70
rooms 71
cleaned 72
well. 73
Wi-fi 74
access 75
worked 76
like 77
dream 78
only 79
one 80
connectivity 81
issue 82
our 83
first 84
night 85
this 86
promptly 87
responded 88
call 89
service 90
ensure 91
that 92
all 93
close 94
72nd 95
Street 96
subway 97
station 98
is 99
complimentary 100
umbrellas 101
days 102
greatly 103
appreciated. 104
fabulous 105
have 106
kitchen 107
cooking 108
facilities 109
whole 110
range 111
foods 112
directly 113
across 114
road 115
at 116
This 117
second 118
time 119
members 120
party 121
stayed 122
Beacon 123
will 124
certainly 125
hotel 126
choice 127
future 128
visits. 129
On 130
every 131
visit 132
NYC, 133
Hotel 134
place 135
love 136
stay. 137
So 138
conveniently 139
located 140
Central 141
Park, 142
Lincoln 143
Center 144
local 145
restaurants. 146
are 147
lovely 148
- 149
beds 150
so 151
comfortable, 152
little 153
new 154
bang 155
coffee 156
maker. 157
staff 158
accommodating 159
just 160
walking 161
street 162
supermarket 163
imaginable 164
goodies 165
eat 166
(if 167
you 168
choose 169
not 170
go 171
property 172
Midtown. 173
We 174
two 175
different 176
during 177
North 178
tower, 179
which 180
inconvenient. 181
You 182
through 183
conference 184
area 185
get 186
north 187
elevators. 188
Andaz 189
Suite. 190
nicely 191
appointed 192
best 193
part 194
about 195
bathroom. 196
From 197
foot 198
soaking 199
bowl 200
bath 201
products, 202
everything 203
bathroom 204
awesome! 205
pancakes 206
must 207
restaurant. 208
One 209
ever. 210
nice 211
central 212
Manhattan. 213
Hyatt 214
has 215
come 216
up 217
modern 218
both 219
convenient. 220
When 221
arrive 222
greeted 223
by 224
friendly 225
they 226
walk 227
check-in 228
desk 229
while 230
offering 231
beverage. 232
had 233
bedroom 234
accommodated 235
four 236
people 237
reasonably 238
Plenty 239
closet 240
space, 241
well 242
lit 243
ceiling 244
windows, 245
actually 246
quiet! 247
large 248
very 249
walk-in 250
shower 251
unique 252
low 253
wash 254
your 255
feet. 256
kitchenette 257
touch 258
stocked 259
fridge 260
non-alcoholic 261
beverages 262
snacks, 263
dishes 264
utensils, 265
sink, 266
dishwasher, 267
microwave. 268
They 269
daily 270
Happy 271
where 272
can 273
decent 274
glass 275
wine 276
modest 277
Lobby 278
Lounge 279
bring 280
room. 281
some 282
seating 283
table 284
8 285
chairs 286
buy 287
food 288
adjacent 289
suggestion 290
offer 291
selections 292
cheese 293
crackers 294
wine. 295
ordered 296
custom 297
made, 298
didn't 299
restaurant 300
off 301
lobby 302
pricey 303
breakfast 304
per 305
within 306
block 307
under 308
what 309
I 310
say? 311
As 312
designer 313
someone 314
who 315
picky 316
hotels, 317
definitely 318
stay 319
there 320
again 321
highly 322
recommend 323
it. 324
each 325
US 326
them 327
all. 328
MUCH 329
better 330
West 331
Hollywood 332
Brand 333
standards 334
slowly 335
fading. 336
star 337
here 338
States. 339
My 340
(suite) 341
12th 342
fantastic 343
as 344
usual. 345
Perfectly 346
maintained, 347
bathrooms 348
(best 349
huge, 350
'room' 351
multiple 352
heads. 353
Double 354
wall. 355
THe 356
bed 357
always 358
perfect. 359
Televisions 360
perfect 361
my 362
limited 363
spend 364
suite. 365
Nice 366
work 367
dining. 368
Every 369
soft 370
drinks, 371
water, 372
sparkling 373
milk 374
touch. 375
Suite 376
full 377
size 378
refrigerator 379
also 380
features 381
microwave, 382
sink 383
dishwasher 384
behind 385
beautiful 386
Really 387
longer 388
stay... 389
do 390
2 391
complaints. 392
First, 393
waits 394
sometimes 395
ridiculous. 396
3 397
elevators 398
serve 399
main 400
tower 401
number 402
THis 403
newer 404
hotel, 405
elevator. 406
continually 407
surprised 408
after 409
waiting 410
an 411
elevator 412
how 413
many 414
stops 415
made 416
housekeeping 417
enter 418
carts 419
etc. 420
How 421
could 422
skip 423
really 424
stinks 425
bad. 426
Lastly, 427
i 428
traveled 429
world 430
know 431
NYC 432
pricing. 433
Breakfast 434
ranks 435
above 436
almost 437
anything 438
ever 439
paid. 440
Apparently, 441
morning, 442
$175.00 443
second. 444
Eggs 445
coffee, 446
Wow. 447
Of 448
course, 449
don't 450
bill. 451
deliver 452
it, 453
leave. 454
Prices 455
listed 456
in-suite 457
menu, 458
billing 459
given. 460
am 461
credit 462
Diamond 463
member, 464
assumed 465
been 466
bill 467
reflected 468
'non 469
charge 470
$110 471
plus 472
night, 473
slightly 474
less 475
wrong, 476
(no 477
way 478
me 479
see 480
this). 481
isn't 482
worth 483
sound 484
those 485
guys 486
complains 487
clearly 488
doesn't 489
things 490
cost. 491
me, 492
more 493
20 494
years 495
staying 496
finest 497
hotels 498
world. 499
great, 500
rank 501
pleasure 502
with. 503
morning 504
Four 505
Seasons 506
NYC. 507
half 508
:) 509
Stay 510
away 511
Excellent 512
(they 513
remembered 514
names 515
moment 516
family 517
walked 518
original 519
overbooked, 520
ended 521
much 522
nicer 523
complaints 524
here). 525
Extremely 526
convenient 527
Fifth 528
Avenue 529
shopping, 530
restaurants, 531
system. 532
Use 533
concierge, 534
magic 535
throughout 536
entire 537
whether 538
needed 539
tickets, 540
merely 541
ride, 542
would 543
their 544
make 545
sure 546
happy. 547
Honestly 548
trouble 549
any 550
other 551
area. 552
superb. 553
forgot 554
called 555
downstairs 556
minutes, 557
four. 558
For 559
there's 560
chance 561
celebrity 562
neighbor 563
happened 564
Jamie 565
his 566
Django 567
promotional 568
tour. 569
Setai 570
last 571
week, 572
company 573
reserved 574
us. 575
Although 576
near 577
Center, 578
shuttled 579
day, 580
found 581
true 582
gem. 583
far 584
value. 585
Loved 586
spacious 587
rooms, 588
furnishings 589
free 590
offerings 591
bar, 592
cookies, 593
Internet, 594
sales 595
help 596
guests, 597
front 598
nicer. 599
door 600
men 601
amazing- 602
assisted 603
last-minute 604
transport 605
needs 606
grace, 607
special 608
thank 609
Mike 610
security 611
team. 612
boss 613
hard 614
impress 615
he 616
already 617
mentioned 618
book 619
next 620
year. 621
husband 622
Chatwal 623
9 624
April 625
2012. 626
booked 627
via 628
booking.com. 629
arrived 630
late 631
easy 632
reviewers 633
got 634
upgraded 635
fell 636
decor. 637
photos 638
website. 639
smelled 640
signature 641
scent. 642
even 643
mixed 644
smell 645
morning. 646
Beds 647
extremely 648
comfortable. 649
upgrade 650
appreciated 651
lot. 652
chic 653
toilets 654
good 655
turn-down 656
service. 657
drinks 658
Club 659
bar 660
nearly 661
friends 662
everything. 663
dinner 664
pleased. 665
did 666
lot 667
alternatives 668
by. 669
couple 670
deliveries 671
concierge 672
helpful 673
them. 674
Mr 675
help. 676
never 677
saw 678
butler 679
stay, 680
therefore 681
cannot 682
comment 683
service, 684
need 685
anyway. 686
Overall 687
5-star 688
boutique 689
experience 690
location. 691
Wonderful 692
Times 693
Square. 694
Subway 695
blocks 696
Numerous 697
classic 698
eateries 699
distance. 700
Bathrooms 701
ideal 702
Japanese 703
cleansing 704
toilettes. 705
because 706
clean, 707
it's 708
A 709
few 710
Herald 711
Square, 712
34th 713
Madison 714
Square 715
Gardens, 716
Penn 717
accommodating. 718
view 719
Empire 720
State 721
Building 722
facing 723
6th 724
Ave. 725
Very 726
cool 727
pic 728
if 729
lucky! 730
satisfied 731
night's 732
again. 733
I've 734
4 735
5 736
over 737
Over 738
past 739
year, 740
however, 741
returned 742
Eventi. 743
staff, 744
incredibly 745
terrific 746
December 747
perfectly 748
Avenue. 749
base 750
explore 751
Manhattan 752
offer. 753
Walking 754
Park 755
took 756
approximately 757
minutes 758
stations 759
piece 760
cake. 761
With 762
regard 763
itself, 764
choice. 765
Location 766
aside, 767
clean 768
appointed. 769
11th 770
floor, 771
sending 772
email 773
prior 774
arrival 775
provided 776
Chrysler 777
Building, 778
requested. 779
itself 780
size, 781
tidy 782
powerful 783
Molton 784
Brown 785
products. 786
lifts 787
servicing 788
wait 789
lift. 790
Both 791
courteous, 792
bell 793
boys. 794
wonderful 795
reception 796
In 797
cups 798
available 799
take 800
you. 801
And 802
afternoon 803
hot 804
cider 805
available. 806
won't 807
hesitate 808
return 809
New 810
York. 811
good. 812
High 813
quality 814
finish 815
throughout, 816
breakfast. 817
Great 818
Rockefeller 819
center 820
5th 821
avenue. 822
right 823
door. 824
Only 825
slight 826
critique 827
life 828
tends 829
around 830
11pm 831
immediate 832
minor 833
York 834
basic 835
acceptable, 836
continental 837
breakfast, 838
fruit 839
juices, 840
grab 841
before 842
head 843
into 844
taxi 845
rush 846
hour 847
rain 848
easiest 849
thing 850
do. 851
problem 852
safe 853
working 854
arrived, 855
fixed 856
mins. 857
Overall, 858
complaints, 859
chose 860
San 861
Carlos 862
based 863
reviews 864
disappointed. 865
condition, 866
helpful. 867
mid 868
uptown 869
events 870
attractions 871
planned. 872
Close 873
enough 874
crowd 875
noise. 876
Near 877
added 878
convenience. 879
guest 880
large, 881
though 882
smaller, 883
visit. 884
location, 885
cleanliness 886
outstanding. 887
Even 888
water 889
supposed 890
11:00 891
p.m. 892
6:00 893
a.m. 894
(do 895
not) 896
affect 897
me. 898
gets 899
flavor 900
favorite 901
swanky 902
City. 903
An 904
intimate 905
atmosphere, 906
attentive 907
courteous 908
Park. 909
Ritz 910
Carlton's 911
try 912
be. 913
If 914
you've 915
Sherry 916
Netherland 917
suggest 918
there, 919
then 920
talking 921
about. 922
pulled 923
curb 924
immediately 925
bellman. 926
He 927
whisked 928
luggage 929
car 930
taken 931
care 932
instantly 933
relaxing, 934
enjyoing 935
hotel. 936
St 937
subway. 938
1 939
24th 940
Hudson 941
River 942
upper 943
Side. 944
Lovely 945
subtle 946
green 947
decor 948
standards. 949
having 950
living 951
lounge 952
converted 953
double 954
children 955
Kitchenette 956
handy 957
in. 958
cook 959
evening 960
meals 961
market 962
fabulous. 963
amazing 964
variety 965
ready 966
cooked 967
meals. 968
Having 969
laundry 970
7th 971
handy. 972
load 973
change 974
reception. 975
doormen 976
Next 977
lift 978
info 979
map 980
used 981
subway, 982
streets 983
these 984
Good 985
bottle 986
shop 987
west 988
side 989
can't 990
say 991
Beacon. 992
hotels. 993
I'm 994
exactly 995
except 996
suites 997
kitchenettes 998
budget-conscious 999
families. 1000
There 1001
weren't 1002
kids, 1003
families 1004
there. 1005
sized 1006
Queen 1007
gave 1008
needed. 1009
Didn't 1010
use 1011
overnight 1012
future. 1013
Rooms 1014
tight 1015
amenities 1016
appreciated, 1017
e.g., 1018
wifi, 1019
Keurig 1020
area, 1021
energy 1022
efficient 1023
(you 1024
put 1025
card 1026
device 1027
controls 1028
electricity 1029
save 1030
you're 1031
out). 1032
(although 1033
hand 1034
towel 1035
slept 1036
pull-out 1037
sofa. 1038
appears 1039
theme, 1040
its 1041
nice. 1042
bellman 1043
held 1044
checkout 1045
allow 1046
city 1047
worry 1048
bags. 1049
Parking 1050
garage 1051
corner 1052
-- 1053
close. 1054
diner 1055
OK 1056
sufficient. 1057
Friendly 1058
folks 1059
Bagel 1060
Talk 1061
too 1062
away. 1063
American 1064
Museum 1065
Natural 1066
History 1067
catch 1068
cab 1069
recommend. 1070
big 1071
huge 1072
bed! 1073
minute 1074
ride 1075
anywhere 1076
want 1077
there! 1078
views 1079
building 1080
windy 1081
weather, 1082
weird 1083
first! 1084
check 1085
Cafe 1086
sit 1087
down 1088
Levain 1089
Bakery 1090
all! 1091
October 1092
week. 1093
Had 1094
suite, 1095
sitting 1096
room/kitchenette, 1097
bath. 1098
rear 1099
building, 1100
might 1101
lower 1102
floors 1103
(the 1104
air 1105
shaft 1106
below 1107
10th 1108
east, 1109
Television 1110
items 1111
snacks. 1112
short 1113
pick 1114
trains. 1115
previously 1116
further 1117
north, 1118
but, 1119
(with 1120
accompanying 1121
compare 1122
Definitely 1123
recommended. 1124
Andaz. 1125
library. 1126
VERY 1127
HUGE 1128
bathroom! 1129
snacks 1130
plus. 1131
quiet. 1132
complaint 1133
bags 1134
getting 1135
cab. 1136
entrance 1137
(which 1138
black 1139
doors 1140
wandered 1141
WAS 1142
train 1143
told 1144
none 1145
should 1146
Ave 1147
one! 1148
No 1149
lots 1150
walk. 1151
Clearly 1152
means 1153
Hopefully 1154
addressed 1155
visit! 1156
lucky 1157
early 1158
December. 1159
Went 1160
adult 1161
daughter 1162
twin 1163
ninth 1164
floor. 1165
It's 1166
tough 1167
find 1168
bonus. 1169
hear 1170
anyone 1171
sleek 1172
design 1173
loved 1174
Being 1175
cold 1176
times 1177
overall 1178
vibe 1179
hotel; 1180
small, 1181
hip, 1182
friendly. 1183
artwork. 1184
Not 1185
warm 1186
cozy 1187
though. 1188
"lobby" 1189
particularly 1190
inviting. 1191
young 1192
experienced 1193
reservations, 1194
shopping 1195
information 1196
general 1197
information. 1198
Easy 1199
Grand 1200
Station 1201
hop 1202
cabs 1203
find. 1204
being 1205
Pubic 1206
Library 1207
Bryant 1208
stores 1209
ice 1210
skating 1211
holidays. 1212
Beats 1213
craziness 1214
book. 1215
problems 1216
believe 1217
corrected 1218
easily. 1219
lack 1220
proper 1221
lighting 1222
designers 1223
thinking 1224
women 1225
designed 1226
dark 1227
difficult 1228
trying 1229
event. 1230
Also 1231
drawer 1232
space 1233
correct 1234
issue. 1235
least 1236
twins 1237
in, 1238
firm 1239
fine 1240
way. 1241
All 1242
though, 1243
memories 1244
Other 1245
note 1246
done 1247
properties 1248
here. 1249
wonderfully 1250
does 1251
job 1252
terms 1253
customer 1254
wife 1255
10am 1256
Saturday 1257
sold 1258
before. 1259
However, 1260
lady 1261
checked 1262
quickly 1263
asked 1264
phone 1265
ready. 1266
went 1267
finished 1268
she 1269
let 1270
mini 1271
frig, 1272
lounge. 1273
drawback 1274
Internet 1275
slow, 1276
stars. 1277
Except 1278
that, 1279
around. 1280
Would 1281
highly. 1282
Just 1283
long 1284
weekend 1285
(late 1286
sons. 1287
surprisingly 1288
NY 1289
beautifully 1290
outstanding 1291
courtesy 1292
helpfulness 1293
pretty 1294
too! 1295
* 1296
preferred 1297
reason 1298
Do 1299
visitor 1300
recommendations. 1301
Everything 1302
suggested 1303
enhanced 1304
Don't 1305
afraid 1306
mean 1307
stroll. 1308
Take 1309
time, 1310
look 1311
you'll 1312
places 1313
foot. 1314
insanely 1315
by, 1316
Garden 1317
beyond 1318
that. 1319
Rockerfeller 1320
fun 1321
circular 1322
route 1323
stroll 1324
Subways 1325
nightmare 1326
clear 1327
London 1328
Paris 1329
once 1330
twice 1331
hang 1332
direction 1333
Taxis 1334
law 1335
unto 1336
themselves. 1337
warned. 1338
Mid-Town 1339
back 1340
instant 1341
could. 1342
Enjoy! 1343
& 1344
Joe 1345
manager 1346
Brian 1347
people, 1348
feel 1349
welcome, 1350
simply 1351
ground 1352
Unfortunately 1353
managed 1354
awful 1355
became 1356
busy 1357
obviously 1358
wanting 1359
tip 1360
! 1361
member 1362
program. 1363
beautiful, 1364
modern, 1365
clean. 1366
standard, 1367
astonish. 1368
Avenue, 1369
Building. 1370
bad 1371
experience. 1372
narrow 1373
uncomfortable 1374
steps 1375
hall 1376
essentially 1377
(so 1378
noisy 1379
hours 1380
talk 1381
given 1382
9th 1383
annoying 1384
conditioning 1385
changed 1386
another 1387
same 1388
window 1389
looking 1390
shaft. 1391
promised 1392
following 1393
day 1394
said 1395
person 1396
spoken 1397
duty 1398
time. 1399
later 1400
out. 1401
and, 1402
unpleasant 1403
manager, 1404
day. 1405
thought 1406
At 1407
point 1408
since 1409
noon 1410
pay 1411
anyway! 1412
Upon 1413
allowed 1414
without 1415
paying 1416
additional 1417
night. 1418
dark, 1419
furniture 1420
stylish 1421
reality 1422
poor 1423
covered 1424
brown 1425
plastic 1426
material. 1427
pool 1428
Finally, 1429
quiet 1430
chat 1431
friend. 1432
view, 1433
grossly 1434
overrated. 1435
layover 1436
trust 1437
Luxury 1438
Collection 1439
accomodations 1440
Midtown 1441
hospital 1442
received 1443
normal 1444
platinum 1445
cap 1446
enjoyed 1447
giving 1448
tour 1449
Features 1450
becoming 1451
high 1452
end 1453
luxury 1454
mirror 1455
TV 1456
seats 1457
midtown 1458
afford 1459
great. 1460
Have 1461
meal 1462
club 1463
resturant 1464
gaze 1465
historic 1466
gone 1467
starts 1468
frequent 1469
joint. 1470
Arrived 1471
Eventi 1472
Montreal. 1473
21st 1474
ESB 1475
(full 1476
ceiling) 1477
surroundings. 1478
(we 1479
mostly 1480
tours 1481
(a 1482
911 1483
memorial 1484
site. 1485
Best 1486
thrill 1487
still 1488
rockefeller 1489
rink 1490
Xmas 1491
decoration. 1492
definitively 1493
between 1494
reading 1495
accomodation 1496
confortable 1497
services 1498
pleasant. 1499
Price 1500
reasonnable 1501
planned 1502
surprise 1503
trip 1504
girlfriend 1505
travel 1506
decision 1507
choosing 1508
champagne 1509
turn 1510
respectable 1511
completely 1512
Everyone 1513
superb 1514
treated 1515
royalty. 1516
Service 1517
aside 1518
shower, 1519
reasonable 1520
(for 1521
NYC) 1522
rate 1523
~ 1524
$330 1525
wi-fi, 1526
$15 1527
mini-bar 1528
equals 1529
theatre 1530
district, 1531
offers 1532
newspapers 1533
fitness 1534
adequate. 1535
plenty 1536
outlets 1537
computers, 1538
charging 1539
phones, 1540
etc., 1541
video 1542
connections 1543
flat 1544
screen 1545
viewing 1546
own 1547
iPads, 1548
computers 1549
room), 1550
bed. 1551
Yes 1552
trendy 1553
cute, 1554
attractive 1555
Sixth 1556
30th 1557
Street, 1558
Kimpton 1559
chain 1560
typically 1561
attractive, 1562
pleasant, 1563
exceptionally 1564
But 1565
neighborhood 1566
dreary 1567
unsafe, 1568
unattractive, 1569
Garden, 1570
middle 1571
retail 1572
district 1573
cheap 1574
wholesale 1575
handbags 1576
I'll 1577
cosy 1578
welcoming 1579
decor, 1580
beat 1581
broadway, 1582
seemed 1583
smaller 1584
liked 1585
(couple 1586
+ 1587
6 1588
yr 1589
old) 1590
three 1591
suitcases 1592
else 1593
steep 1594
(not 1595
city) 1596
prices. 1597
suit 1598
intend 1599
spending 1600
that's 1601
positive 1602
overall. 1603
Perfect 1604
Theater, 1605
Radio 1606
Music 1607
Hall. 1608
complaint, 1609
paid 1610
$60 1611
bowls 1612
oatmeal, 1613
orders 1614
toast, 1615
tea. 1616
20% 1617
tip, 1618
Better 1619
choice, 1620
Red 1621
Flame 1622
block. 1623
8:30 1624
calling 1625
ahead 1626
tell 1627
expect 1628
doorman 1629
me! 1630
Once 1631
employee 1632
decided 1633
show 1634
along 1635
holding 1636
him. 1637
finally 1638
him 1639
luggage. 1640
adjust 1641
temperature 1642
unit, 1643
off. 1644
lied 1645
engineer 1646
activated 1647
timer 1648
minimum 1649
bag 1650
fear 1651
losing 1652
dark. 1653
wall 1654
plugs 1655
filled 1656
hotel's 1657
stuff. 1658
hands 1659
knees 1660
strip 1661
plug 1662
underneath 1663
charge. 1664
Then 1665
outlet 1666
IPhone 1667
turned 1668
light, 1669
dead 1670
NOT 1671
overnight. 1672
mattress 1673
why 1674
stars 1675
instead 1676
two. 1677
Now, 1678
shower: 1679
arm 1680
turning 1681
absolutely 1682
NO 1683
hot, 1684
is. 1685
step 1686
outside 1687
tub/shower 1688
ventilation 1689
Therefore, 1690
ruined 1691
windows. 1692
so-called 1693
room: 1694
top 1695
light 1696
coming 1697
light. 1698
addition, 1699
wooden 1700
tilted 1701
entering 1702
What 1703
dismal 1704
Breakfast: 1705
argument 1706
order 1707
yes. 1708
eggs. 1709
boil 1710
eggs, 1711
eggs 1712
wear 1713
asked. 1714
situation, 1715
opinion. 1716
earplugs 1717
play 1718
sleep 1719
neighboring 1720
screamed 1721
headboard 1722
AM 1723
conference, 1724
stored 1725
gym 1726
PM 1727
shoes 1728
home 1729
evening. 1730
fair 1731
good, 1732
too. 1733
finally, 1734
noted 1735
originally 1736
escorted 1737
answer 1738
Now 1739
safely 1740
home, 1741
most 1742
ridiculous 1743
heard. 1744
annual 1745
year 1746
selected 1747
Iroquois 1748
friendliest 1749
brings 1750
chocolates 1751
weather 1752
forecast 1753
Allan 1754
knowledgeable 1755
gives 1756
honest 1757
opinion 1758
serves 1759
Can't 1760
shops 1761
Macy's 1762
friend 1763
visiting 1764
show. 1765
common 1766
tourist 1767
sites, 1768
Theater 1769
District. 1770
wanted 1771
keep 1772
doing 1773
sightseeing. 1774
offered 1775
advice 1776
reservation 1777
compared 1778
orderly. 1779
value 1780
price, 1781
quarter 1782
seem 1783
midst 1784
holiday 1785
initial 1786
impression 1787
positive. 1788
stopped 1789
meeting 1790
man 1791
chat. 1792
10 1793
later, 1794
wasn't 1795
problem, 1796
long. 1797
handicapped 1798
interesting 1799
Otherwise, 1800
pillows 1801
impressed 1802
small 1803
(in 1804
addition 1805
bar), 1806
contained 1807
plates 1808
That 1809
I'd 1810
price 1811
right! 1812
After 1813
alot 1814
fab 1815
walkable 1816
square, 1817
avenue 1818
tube 1819
stations. 1820
Local 1821
bagel 1822
3rd 1823
ave 1824
funky 1825
rooftop 1826
road. 1827
style 1828
resting 1829
miss 1830
kept 1831
spotless. 1832
bathtub 1833
rest 1834
tea/coffee 1835
P.S. 1836
Indian 1837
fourth 1838
suitcase 1839
desk. 1840
polite 1841
professional 1842
nice, 1843
unfortunately 1844
"suite 1845
realy 1846
time). 1847
refrigerator, 1848
Manhattan, 1849
included). 1850
Certainly 1851
You'll 1852
business 1853
leisure 1854
accommodations 1855
enormous 1856
eating 1857
spots. 1858
helped 1859
regain 1860
accommodating, 1861
friendly, 1862
professional. 1863
hope 1864
opportunity 1865
soon! 1866
4-day 1867
Plaza 1868
Hotel, 1869
Apple 1870
Store, 1871
stone's 1872
throw 1873
concierge. 1874
operated 1875
felt 1876
treat 1877
down. 1878
girl 1879
her 1880
dressing 1881
(!!!) 1882
plush 1883
white 1884
robe 1885
ample 1886
things, 1887
maker 1888
unlimited 1889
flowers, 1890
boxes 1891
manager. 1892
attached 1893
delicious, 1894
filling 1895
form 1896
before, 1897
hanging 1898
knob, 1899
neighbours 1900
making 1901
noise, 1902
midnight. 1903
Within 1904
upstairs 1905
shortly 1906
thereafter 1907
couldn't 1908
wifi 1909
work, 1910
send 1911
IT 1912
figure 1913
attentive, 1914
although 1915
attitude 1916
leave 1917
chocolate 1918
squares 1919
clothes 1920
looked 1921
home. 1922
sister 1923
meet 1924
excellent 1925
vary 1926
especially 1927
decorated. 1928
expensive 1929
quality. 1930
makes 1931
help, 1932
operators 1933
guy. 1934
friendly! 1935
nearby! 1936
week 1937
tenth 1938
!! 1939
helpful, 1940
park 1941
away... 1942
feature 1943
"Fairway 1944
(and 1945
latte 1946
want. 1947
relaxed 1948
East 1949
side, 1950
park. 1951
affordable 1952
bonus 1953
Supermarket 1954
wide 1955
food. 1956
partner 1957
holidays 1958
ever! 1959
beacon 1960
heaven 1961
manhattan. 1962
whilst 1963
keeping 1964
hustle 1965
bustle 1966
however 1967
30/40 1968
eg. 1969
Rockafella 1970
centre. 1971
advise 1972
bus 1973
$54 1974
dollars 1975
allows 1976
helps 1977
(especially 1978
10. 1979
enough! 1980
Irene 1981
(I 1982
agree 1983
2011) 1984
numerous 1985
flights, 1986
transportation, 1987
closed 1988
down, 1989
etc.). 1990
fitted 1991
beat. 1992
again! 1993
word 1994
wise 1995
select 1996
carefully 1997
loft 1998
8th 1999
floor; 2000
(it 2001
inform 2002
appropriate 2003
single 2004
traveler. 2005
office 2006
lay 2007
lived 2008
Bathroom 2009
roomy 2010
Decor 2011
meets 2012
European 2013
City 2014
filter 2015
ear 2016
case 2017
bothers 2018
attentive. 2019
(breakfast 2020
service); 2021
dining 2022
areas, 2023
lounges 2024
marked 2025
guess 2026
bit. 2027
tons 2028
options. 2029
observation 2030
complaint: 2031
decorations 2032
December! 2033
First 2034
impressed. 2035
Walk 2036
distance 2037
Top 2038
Rock, 2039
etc.... 2040
amazing!! 2041
type 2042
decor) 2043
bathroom, 2044
included 2045
specially 2046
Jenny 2047
Rodriguez 2048
wardrobe 2049
closet. 2050
like: 2051
stylish, 2052
advance 2053
loyalty 2054
program 2055
iPod 2056
recommendations 2057
delighted 2058
food, 2059
live 2060
jazz 2061
incredible 2062
Sarah 2063
served 2064
specialty 2065
cocktail 2066
menu 2067
now 2068
bartender 2069
did! 2070
LOVED 2071
Special 2072
thanks 2073
whenever 2074
york 2075
will, 2076
books 2077
same. 2078
Amazing 2079
service!! 2080
beds!! 2081
LOVE 2082
recent 2083
NY, 2084
colleagues 2085
recommended 2086
stays 2087
happily 2088
client 2089
visiting. 2090
facilities. 2091
card. 2092
annoyed 2093
longer. 2094
business, 2095
wouldn't 2096
likes 2097
shower. 2098
delayed 2099
down), 2100
entered 2101
gloomy 2102
horrible 2103
musty 2104
odor, 2105
quick 2106
lunch 2107
resaurant 2108
inedible, 2109
overly 2110
poured 2111
waiter 2112
brand 2113
pour 2114
say, 2115
tasted 2116
chef 2117
restaurant, 2118
written 2119
review 2120
treat, 2121
thanksgiving. 2122
shops, 2123
theatres, 2124
tv's 2125
mirrors, 2126
toilet 2127
baths. 2128
had. 2129
Art 2130
Deco 2131
exceptional 2132
Give 2133
miss. 2134
15 2135
ft 2136
website 2137
Staff!! 2138
December, 2139
extra 2140
old 2141
son. 2142
recognized 2143
out, 2144
noticed 2145
Tim, 2146
funny 2147
Oh 2148
birthday 2149
left 2150
cupcakes 2151
great! 2152
super 2153
(but 2154
NYC). 2155
Ours 2156
queen 2157
else. 2158
negative 2159
dimly 2160
understand 2161
saving 2162
brighter 2163
fluffy 2164
duvet 2165
comforters 2166
pillows. 2167
phones 2168
computers. 2169
views. 2170
face 2171
empire 2172
state 2173
bummer 2174
hoped 2175
centrally 2176
2nd 2177
sky 2178
roof 2179
awesome 2180
summer 2181
do). 2182
stay! 2183
Ink 2184
48 2185
ago 2186
returning 2187
figured 2188
expectation 2189
act 2190
follow 2191
resolved 2192
timely 2193
manner 2194
UK. 2195
stones 2196
haven 2197
TV, 2198
dock 2199
comfy 2200
Lots 2201
power 2202
sockets 2203
Staff 2204
ten 2205
sightseeing 2206
shopping... 2207
UK 2208
present 2209
sent 2210
Champagne, 2211
fantastic. 2212
requested 2213
disappoint. 2214
brilliant 2215
city. 2216
min 2217
station. 2218
restaurants 2219
deli's 2220
marvellous! 2221
atmosphere 2222
delightful. 2223
Recommend 2224
Tony's 2225
portions 2226
steak 2227
think 2228
ate 2229
back. 2230
Oh, 2231
comfiest 2232
in!!!! 2233
Iroquois. 2234
spots 2235
slow 2236
stairs. 2237
apple 2238
hung 2239
library 2240
sipping 2241
place. 2242
wish 2243
smile. 2244
cozy. 2245
Centre. 2246
Also, 2247
stuffy 2248
charm 2249
course 2250
opening 2251
louder 2252
brought 2253
earplugs. 2254
sleeper, 2255
York! 2256
right. 2257
dresser 2258
fridge, 2259
chair. 2260
Pretty 2261
standard. 2262
Unfortunately, 2263
radius 2264
Irish 2265
Pubs 2266
happen 2267
important 2268
trip. 2269
priced, 2270
"the 2271
red 2272
price. 2273
mentioned, 2274
kid 2275
yourself 2276
sights, 2277
alot. 2278
Bring 2279
shoes. 2280
conceirge 2281
came 2282
directions, 2283
lines, 2284
navigate 2285
yourself. 2286
Thumbs 2287
Thanksgiving. 2288
Hotel. 2289
it! 2290
described. 2291
cleanest 2292
at. 2293
updated 2294
wonderful. 2295
reservation. 2296
GREAT! 2297
orange 2298
juice 2299
squeezed 2300
delicious. 2301
basket 2302
pastries 2303
freshly 2304
surely 2305
amenities. 2306
overbearing. 2307
mile 2308
give 2309
directions 2310
tourist. 2311
elegance 2312
comforting 2313
against 2314
city! 2315
Thanksgiving 2316
access, 2317
luxuries 2318
kept. 2319
husband, 2320
son 2321
executive 2322
We're 2323
appreciate 2324
convenience 2325
people. 2326
pullout 2327
kitchen. 2328
linens 2329
appointments 2330
notch. 2331
spotless 2332
comfy. 2333
includes 2334
buffet 2335
best. 2336
owner 2337
presented 2338
said, 2339
attention 2340
you! 2341
town, 2342
train, 2343
museums 2344
avenues 2345
recently 2346
husband's 2347
parents 2348
father 2349
80th 2350
birthday. 2351
charming, 2352
quiet, 2353
locations 2354
unbeatable 2355
heart 2356
Rockfeller 2357
enjoy 2358
walking). 2359
relax 2360
exploring 2361
facility 2362
instead, 2363
outdated 2364
downstairs, 2365
fault 2366
management 2367
operate 2368
charm. 2369
Sherry! 2370
walking, 2371
theatre, 2372
50's.We 2373
back! 2374
location... 2375
attractions, 2376
character 2377
Louis 2378
such 2379
Beautiful 2380
locale 2381
dining, 2382
glorious 2383
started 2384
money 2385
considering 2386
benefit. 2387
escape 2388
zoo 2389
gardens 2390
museum 2391
more... 2392
fifth 2393
oustanding 2394
Bedroom 2395
interior 2396
architecture 2397
spa 2398
spent 2399
accomodation. 2400
kitchenette. 2401
According 2402
reservation, 2403
shall 2404
selection 2405
non 2406
bottles 2407
water. 2408
coke 2409
necessary 2410
overpriced 2411
annoying. 2412
promise 2413
fulfilled. 2414
aspect 2415
advantages 2416
personal 2417
letter 2418
Usually 2419
receive 2420
fruits, 2421
internet 2422
pre 2423
assistance 2424
requirements 2425
difficulties 2426
reach 2427
phone. 2428
sixth 2429
call. 2430
hotel: 2431
limit. 2432
good! 2433
Despite 2434
issues 2435
honestly 2436
others. 2437
myself 2438
itching 2439
crazy! 2440
unfortunate 2441
suffered 2442
major 2443
advised 2444
booking 2445
(as 2446
EVERY 2447
excellent, 2448
booked. 2449
Zealand 2450
11:00pm 2451
disappointment. 2452
nothing 2453
ALL 2454
ROOMS 2455
"no 2456
welcome 2457
spoke 2458
checking 2459
bathtub. 2460
woman 2461
refund 2462
inconvenience 2463
sort 2464
mess 2465
arranging 2466
reply 2467
do" 2468
saying 2469
sorry 2470
caused 2471
hotel! 2472
moved 2473
upon 2474
notice 2475
York, 2476
PERFECT 2477
FOR 2478
HAVE 2479
running 2480
budget 2481
check-out. 2482
yes, 2483
guarantee 2484
deliver. 2485
bf 2486
regularly, 2487
W, 2488
Waldorf, 2489
Ritz, 2490
etc... 2491
excellent. 2492
truly 2493
property, 2494
taxi, 2495
directed 2496
towards 2497
counter. 2498
pleasant 2499
surprise. 2500
departure, 2501
knew 2502
introduce 2503
memorable 2504
elevator, 2505
Brandon 2506
glasses, 2507
one. 2508
previous 2509
posters 2510
aren't 2511
big, 2512
expected, 2513
gorgeous. 2514
Leather 2515
amazing. 2516
While 2517
bathtub, 2518
neat 2519
japanese 2520
pressed 2521
dinner. 2522
pool, 2523
facilities, 2524
adequate, 2525
convenient, 2526
isolated 2527
traffic 2528
for, 2529
pricey. 2530
Was 2531
it? 2532
upgrade. 2533
Thank 2534
consider 2535
destination 2536
world, 2537
Iroquois! 2538
comfort 2539
others 2540
forward 2541
fairly 2542
typical 2543
age 2544
Vanessa 2545
takes 2546
often, 2547
flowers 2548
Management. 2549
request 2550
sense 2551
past, 2552
Star 2553
alive 2554
Excelent 2555
accomodations. 2556
Big, 2557
suites. 2558
incredible. 2559
ask 2560
something 2561
phone, 2562
arrives 2563
solve 2564
problem. 2565
seen 2566
fast 2567
remember. 2568
city... 2569
going 2570
honeymoon 2571
Due 2572
electric 2573
hurricane 2574
Sandy 2575
Marathon 2576
falling 2577
Plaza, 2578
Pierre, 2579
Essex 2580
House 2581
bright 2582
ample. 2583
included. 2584
2yrs 2585
planning 2586
husbands 2587
kids 2588
Ireland 2589
headed 2590
shopping. 2591
Sat 2592
27th 2593
Monday 2594
29th 2595
adventure 2596
somewhat 2597
Thanks 2598
Carlos. 2599
(at 2600
unlike 2601
stories 2602
heard 2603
weary 2604
ladies. 2605
Highly 2606
mine 2607
visited 2608
viewed 2609
small; 2610
expected 2611
answered 2612
questions 2613
fastest 2614
particular 2615
towels 2616
check-out 2617
smooth 2618
process 2619
again!! 2620
met 2621
wish. 2622
details. 2623
Love 2624
detail, 2625
lights, 2626
strategically 2627
placed 2628
suprisingly 2629
hospitality 2630
welcoming. 2631
unexpected 2632
NY. 2633
Sometimes 2634
stands 2635
television, 2636
Took 2637
Day 2638
anniversary. 2639
Starwood 2640
points 2641
Little 2642
pricey, 2643
nifty 2644
gorgeous 2645
Interior 2646
lovely. 2647
things. 2648
retro 2649
massive 2650
space. 2651
appointments. 2652
kind 2653
imagine 2654
1920s 2655
cruise 2656
ship. 2657
leather 2658
handles, 2659
Cool 2660
bar. 2661
awesome. 2662
unreal 2663
seat 2664
dry. 2665
Too 2666
really, 2667
vacation. 2668
alley, 2669
view. 2670
matter. 2671
Wish 2672
higher 2673
very, 2674
Free 2675
shoe 2676
shine 2677
handle 2678
pressing 2679
dress 2680
Did 2681
highlights 2682
excellence 2683
We'd 2684
connecting 2685
unreal. 2686
Like 2687
standing 2688
sleep. 2689
participate 2690
maids 2691
9. 2692
complained 2693
back, 2694
they'd 2695
packed 2696
charger 2697
plugged 2698
assist. 2699
Honestly, 2700
probably 2701
expecting 2702
level, 2703
exceeded 2704
expectations, 2705
gold 2706
status 2707
anything, 2708
much, 2709
points. 2710
inexpensive. 2711
$700 2712
we'd 2713
pocket. 2714
level 2715
St. 2716
Regis 2717
Bottom 2718
cool, 2719
due 2720
proximity 2721
friend's 2722
recommendation. 2723
grand 2724
entrance, 2725
inside 2726
art 2727
deco 2728
basis 2729
cocktails. 2730
experienced, 2731
toilet, 2732
entertaining! 2733
broadway 2734
choices 2735
drinking 2736
establishments. 2737
penny. 2738
AMAZING 2739
HOTEL!! 2740
here!! 2741
helpful!! 2742
reasons 2743
loyal 2744
hotel!! 2745
vacation 2746
comfortable! 2747
york!! 2748
employees, 2749
assistant 2750
Helped 2751
whatever 2752
need, 2753
whatever. 2754
reservations 2755
months 2756
on. 2757
BEST 2758
to. 2759
travels 2760
Jason 2761
relaxing 2762
got. 2763
fill 2764
paper 2765
treatment, 2766
Anniversary 2767
weeks 2768
ago, 2769
professionalism 2770
kindness 2771
treatments 2772
wished 2773
pushed 2774
button 2775
us, 2776
million 2777
recommending 2778
family. 2779
May 2780
2011 2781
attend 2782
wedding. 2783
eye 2784
sister, 2785
brother 2786
month 2787
dog 2788
driven 2789
library, 2790
glimpse 2791
toiletries. 2792
dishwasher. 2793
rate. 2794
Since 2795
adults 2796
delivered 2797
yet 2798
feels 2799
uncomfortably 2800
furnished 2801
useless 2802
read 2803
desk) 2804
inches 2805
normal. 2806
chair 2807
mounted 2808
screens, 2809
set 2810
feet 2811
ground, 2812
unless 2813
generally 2814
screen. 2815
all, 2816
strange 2817
bath, 2818
mold 2819
tile 2820
grout 2821
wall, 2822
obvious 2823
tile. 2824
BR 2825
group 2826
girls' 2827
couch 2828
room). 2829
store 2830
leftovers 2831
items. 2832
requests 2833
towels, 2834
concert 2835
music. 2836
brownstone 2837
homes 2838
nearby. 2839
(less 2840
stop. 2841
kinds 2842
travelers. 2843
godsend 2844
need. 2845
initially 2846
view; 2847
natural 2848
sharp 2849
(!!) 2850
glasses 2851
regarding 2852
tix 2853
booth 2854
downtown 2855
incorrect. 2856
wasting 2857
travelling 2858
result. 2859
$10 2860
to/from 2861
attractions. 2862
August 2863
bedroom, 2864
HUGE, 2865
machine, 2866
cleaning 2867
door, 2868
effort 2869
greet 2870
customers 2871
remembers 2872
ones 2873
complaints: 2874
1. 2875
ventilation, 2876
steam 2877
up. 2878
couple, 2879
awkward 2880
trip! 2881
2. 2882
wireless 2883
amount 2884
paid, 2885
option 2886
computer 2887
men, 2888
stand 2889
spot 2890
(walking 2891
walk). 2892
bigger 2893
soaps 2894
toiletries 2895
Appreciated 2896
bottled 2897
Houston 2898
Western 2899
phenomenal 2900
personable. 2901
expectations 2902
location! 2903
Hilton 2904
Americas 2905
fresh, 2906
new, 2907
fluffy, 2908
large. 2909
skyline. 2910
appointed, 2911
convention 2912
center, 2913
Toyota 2914
groceries 2915
(over 2916
best! 2917
caring, 2918
detail 2919
desire 2920
accommodate 2921
compare. 2922
admit, 2923
concerns, 2924
Jacques 2925
attention, 2926
deck 2927
boasts 2928
children's 2929
park, 2930
grocery 2931
eats 2932
(sp?) 2933
Americas. 2934
Houston. 2935
several 2936
bikes, 2937
TV's 2938
eaten 2939
buffet. 2940
selection, 2941
maybe 2942
overpriced. 2943
During 2944
visit, 2945
waitress 2946
until 2947
track 2948
check. 2949
rating. 2950
pleasent 2951
period 2952
starting 2953
goes 2954
maids, 2955
maintance 2956
eager 2957
gem, 2958
charm, 2959
stunning 2960
7 2961
thoroughly 2962
utmost 2963
home! 2964
bellman, 2965
operator, 2966
... 2967
kind, 2968
efficient. 2969
amenities, 2970
Park! 2971
two-night 2972
terrific. 2973
Check 2974
wet 2975
soft, 2976
linens. 2977
TVs 2978
channels. 2979
towels. 2980
month. 2981
corner. 2982
traveling 2983
kids. 2984
Pleasant 2985
pleasantly 2986
perk 2987
Girls 2988
tickets 2989
perform 2990
Brooklyn. 2991
rental 2992
vs. 2993
Finally 2994
settled 2995
choice! 2996
SPACIOUS 2997
room! 2998
rented 2999
kitchen, 3000
complete 3001
Clean, 3002
( 3003
heat 3004
luxury. 3005
1/2 3006
Couldn't 3007
Theatre 3008
District, 3009
shopping! 3010
regularly 3011
rare 3012
combination 3013
highest 3014
maintenance 3015
nicest 3016
changes 3017
assist 3018
guests 3019
can. 3020
3. 3021
internet, 3022
biz 3023
more. 3024
Sandy, 3025
ran 3026
everyone 3027
(given 3028
numbers 3029
ppl 3030
traveler, 3031
k 3032
location- 3033
praise 3034
welcome! 3035
respects...room 3036
thats 3037
Concierge 3038
delightful 3039
theatre. 3040
Tje 3041
Clean 3042
location...a 3043
November. 3044
tips 3045
guard 3046
require 3047
asking 3048
skyline 3049
traffic. 3050
Most 3051
public 3052
transport. 3053
bars 3054
nearby 3055
Flatiron 3056
district. 3057
gift 3058
mini-bar. 3059
bonus, 3060
once. 3061
tea 3062
personally, 3063
currently 3064
taking 3065
Texas 3066
DC 3067
worldwide 3068
beyond. 3069
Nothing 3070
trouble... 3071
worn 3072
44th 3073
theaters 3074
Small 3075
adequate 3076
tub 3077
shares 3078
Door 3079
Spa. 3080
Chatwal. 3081
Service: 3082
some! 3083
Junior 3084
beautiful. 3085
amazing; 3086
fit 3087
galleries, 3088
unfailingly 3089
lost 3090
post 3091
Sandy. 3092
worn. 3093
SPG 3094
rack 3095
Matt 3096
THE 3097
MAN. 3098
city, 3099
prices 3100
options, 3101
ready, 3102
curtains, 3103
beverage 3104
Unlike 3105
others, 3106
minimalistic 3107
ladies) 3108
delightfully 3109
(37th 3110
retreat 3111
Square/Midtown 3112
Glad 3113
mention 3114
too? 3115
floating 3116
open! 3117
City! 3118
Refreshing 3119
straight 3120
below. 3121
decide 3122
wants 3123
apartment 3124
lines 3125
corporate 3126
apartment. 3127
pricing 3128
among 3129
touches 3130
special, 3131
league 3132
Carlton 3133
Mandarin 3134
Peninsula 3135
daughters. 3136
one-bedroom 3137
opposed 3138
suite). 3139
Half 3140
answer. 3141
lacking. 3142
experience, 3143
special. 3144
mainly 3145
disappointing, 3146
thus 3147
premium 3148
five 3149
holiday. 3150
oversized 3151
snack. 3152
generously 3153
uses 3154
remember 3155
parked 3156
package, 3157
amenity. 3158
prefer 3159
W. 3160
tall 3161
Views 3162
Ipod 3163
docking 3164
useful. 3165
wardrobe. 3166
hesitation 3167
Superb 3168
town 3169
sleek, 3170
unusual 3171
interaction 3172
feeling 3173
oriented. 3174
own. 3175
sounds 3176
appealing, 3177
Located 3178
42nd 3179
City, 3180
better. 3181
(including 3182
train. 3183
Plus 3184
buses, 3185
taxis 3186
hostile 3187
Anyway, 3188
splendid 3189
start 3190
granted 3191
basically 3192
sheer 3193
bedrooms, 3194
generous 3195
balcony, 3196
baths 3197
palace. 3198
matter 3199
anything! 3200
(It 3201
exquisite 3202
heavenly 3203
showers 3204
luxurious 3205
robes 3206
where. 3207
bathrooms, 3208
closets 3209
enabled 3210
walls) 3211
shades 3212
covering 3213
spectacular 3214
(NY 3215
Public 3216
Library, 3217
etc.) 3218
listen 3219
nor 3220
watch 3221
equipped 3222
entertained 3223
style. 3224
minibar 3225
delicious 3226
teas, 3227
nutritious 3228
may 3229
beer 3230
two, 3231
notice. 3232
King 3233
linens, 3234
Plus, 3235
Yum! 3236
diamond 3237
made-to-order 3238
charge! 3239
gentle 3240
knock 3241
To 3242
bringing 3243
waited 3244
precise 3245
gives! 3246
solo, 3247
Checkout 3248
(4 3249
PM, 3250
leave! 3251
Situated 3252
renovated 3253
Its 3254
41st 3255
quirky 3256
electronic 3257
weekend. 3258
Regular 3259
hotel,i 3260
location...simple,clean,not 3261
crazy 3262
expensive,not 3263
,with 3264
beds! 3265
visit.We 3266
suite,has 3267
room,a 3268
kitchinette 3269
bedroom.Very 3270
money! 3271
regular 3272
Suites 3273
separate 3274
maintained 3275
ladies 3276
tip) 3277
Museum. 3278
Across 3279
Market, 3280
jewel 3281
stock 3282
international 3283
delight. 3284
decorated 3285
fridge. 3286
Columbus 3287
circle 3288
children. 3289
located, 3290
midtown. 3291
Picked 3292
primarily 3293
realized 3294
expectations. 3295
spacious, 3296
personable 3297
professional, 3298
hoped. 3299
vacation, 3300
awarding 3301
brand, 3302
printed 3303
interested 3304
shared 3305
beds. 3306
assemble 3307
crib 3308
daughter. 3309
Daily 3310
sandwiches 3311
Useful 3312
hungry 3313
Big 3314
jacuzzi 3315
parking 3316
twice. 3317
Houston, 3318
University 3319
Galleria, 3320
etc.. 3321
looks 3322
rough 3323
closer 3324
upscale 3325
here! 3326
parking! 3327
assuring 3328
country. 3329
notch 3330
lobby, 3331
lounge, 3332
spa, 3333
23rd 3334
connected 3335
bridge 3336
Hilton's 3337
spaces 3338
ballrooms 3339
spaces. 3340
impressive. 3341
Things 3342
Texas. 3343
thick 3344
business/conference 3345
surrounding 3346
Huge 3347
stop 3348
access. 3349
today 3350
3pm. 3351
highways. 3352
sporting 3353
event 3354
Wi-Fi. 3355
Hobby 3356
Airport. 3357
hallways 3358
Attended 3359
food! 3360
months, 3361
trip, 3362
Inn 3363
Quick 3364
quicker 3365
checkout. 3366
smiles. 3367
items, 3368
Many 3369
reliable 3370
garden 3371
inn. 3372
item 3373
bit, 3374
control 3375
excellent) 3376
ticked 3377
boxes, 3378
average, 3379
slipped 3380
badly 3381
shower). 3382
self 3383
(apart 3384
microwave 3385
tiny 3386
(there 3387
waking 3388
drink 3389
(too 3390
meant 3391
Bar 3392
purchase 3393
shy 3394
;-) 3395
oil 3396
gas 3397
Omni 3398
time... 3399
relatively 3400
Galleria. 3401
fancy 3402
functional 3403
expected. 3404
adjustable 3405
dial 3406
average 3407
$10. 3408
internet. 3409
Fast 3410
connection 3411
July 3412
2012 3413
showed 3414
June 3415
thru 3416
business. 3417
extend 3418
La 3419
int 3420
shape. 3421
Especially 3422
renovation 3423
fix 3424
tried 3425
herself 3426
needless 3427
eventually 3428
Sal 3429
office, 3430
distance, 3431
hidden 3432
gem 3433
V 3434
S. 3435
resident 3436
extended 3437
america 3438
Extended 3439
bagels 3440
muffins. 3441
Furniture 3442
condition 3443
bed's 3444
mattress, 3445
bedding 3446
dip 3447
middle. 3448
fine, 3449
overlooked 3450
average. 3451
interested. 3452
sophisticated 3453
place, 3454
enough. 3455
fact 3456
priced. 3457
nights, 3458
using 3459
third 3460
restaurant... 3461
un 3462
til 3463
3pm 3464
payed 3465
dined 3466
messed 3467
times. 3468
okay, 3469
friendlier 3470
mediocre 3471
considered 3472
Marriott 3473
Autograph 3474
former 3475
bank 3476
renovations. 3477
character. 3478
And, 3479
bar/restaurant 3480
menu. 3481
Sunday 3482
$10.95 3483
deal! 3484
key 3485
floors, 3486
seeing 3487
key. 3488
shuttle 3489
radius. 3490
this! 3491
beware 3492
do/see 3493
fact, 3494
Downtown 3495
weekends. 3496
rail 3497
metro. 3498
fare, 3499
parts 3500
handful 3501
Congress 3502
diverse 3503
breakfast! 3504
But, 3505
fan 3506
Marriott. 3507
Gold 3508
somewhere 3509
wedding 3510
Housekeeping 3511
late, 3512
inconsistent 3513
pot 3514
days, 3515
35 3516
delivered. 3517
6:45 3518
airport. 3519
Hoping 3520
advantage 3521
6:30 3522
opened 3523
physical 3524
bank, 3525
seems 3526
match. 3527
desired. 3528
Apparently 3529
pent 3530
house 3531
By 3532
parties. 3533
Yes, 3534
loud 3535
drunken 3536
party! 3537
music 3538
loud, 3539
disturbance 3540
Party 3541
Hostess 3542
suggesting 3543
join 3544
mind 3545
anymore 3546
attendant 3547
considerate 3548
understanding 3549
Hospitality 3550
solutions 3551
offered. 3552
frustrating. 3553
appeared 3554
Christmas 3555
enjoyable 3556
construction 3557
woke 3558
deal, 3559
sweet 3560
movie 3561
shops. 3562
Bistro 3563
price) 3564
soup 3565
band 3566
played 3567
Continental 3568
catered 3569
choices, 3570
cereal, 3571
lattes 3572
Sorella 3573
restaurants/bars/shops. 3574
catering 3575
planners. 3576
Wow, 3577
surprise! 3578
campus. 3579
Jr. 3580
minimal 3581
fee, 3582
spacious. 3583
amazingly 3584
tag 3585
speak 3586
broken 3587
English 3588
requests. 3589
admit 3590
stumbled 3591
glad 3592
created 3593
result 3594
teaching 3595
platform 3596
perfection. 3597
contact 3598
immaculate. 3599
exits 3600
hwy 3601
question 3602
have! 3603
university 3604
worried 3605
noise... 3606
surprised. 3607
campus, 3608
specious 3609
young, 3610
flawless. 3611
requests, 3612
now. 3613
Location, 3614
genteel 3615
ambience, 3616
comfort, 3617
staffing 3618
services, 3619
exceptional. 3620
return. 3621
Cabs 3622
hailed 3623
add 3624
bygone 3625
cleanliness, 3626
professionalism, 3627
Harry's 3628
Bar. 3629
Bedrooms 3630
decorated, 3631
soda 3632
equipment, 3633
dollars). 3634
expensive, 3635
run 3636
unit 3637
owners 3638
directing 3639
company. 3640
are. 3641
usual 3642
prices, 3643
specials 3644
OK. 3645
daughter, 3646
drinks. 3647
disappointment 3648
grandson. 3649
pulling 3650
together 3651
one, 3652
happen. 3653
known 3654
Tripadvisor 3655
reviews, 3656
calm 3657
street. 3658
8am 3659
come, 3660
complementary 3661
lobby. 3662
address 3663
pizzeria 3664
Brooklyn 3665
(18 3666
floors) 3667
(see 3668
photo 3669
receives 3670
Spanish 3671
speaking 3672
hosts 3673
Each 3674
employees 3675
trick 3676
laughed 3677
Complimentary 3678
depending 3679
mood. 3680
rest. 3681
usually 3682
trips. 3683
researched 3684
ability 3685
needs. 3686
situated 3687
box 3688
stores, 3689
desk, 3690
gourmet 3691
up, 3692
you, 3693
suitable 3694
bite 3695
begin 3696
building. 3697
kick 3698
watching 3699
scene 3700
gentlemen 3701
Ask 3702
comf 3703
Breakfest 3704
basic. 3705
Will 3706
sure. 3707
(by 3708
standards) 3709
Central. 3710
real 3711
flight 3712
info. 3713
street, 3714
Yorkers 3715
There's 3716
opposite 3717
pound 3718
we'll 3719
Time 3720
Patrick's 3721
Cathedral, 3722
Ave, 3723
etc 3724
island 3725
reach. 3726
possible 3727
airlines 3728
basis. 3729
enjoy. 3730
Comfy 3731
nightly 3732
bits 3733
(very 3734
useful 3735
zero 3736
moveis 3737
DVD 3738
player 3739
newspaper 3740
Fantastic. 3741
returning. 3742
unpretentious 3743
brilliantly 3744
manhattan 3745
NYC! 3746
there- 3747
busy. 3748
eventi 3749
40th 3750
Before 3751
emailed 3752
booking.com 3753
occasion. 3754
smiley 3755
members. 3756
Statue 3757
Liberty 3758
wer 3759
excited 3760
s 3761
note. 3762
brilliant. 3763
Whole 3764
maid 3765
trouble. 3766
wine, 3767
biscuits 3768
travellers 3769
did. 3770
mins 3771
t 3772
Staten 3773
Island 3774
ferry 3775
battery 3776
round 3777
Wall 3778
site 3779
prime 3780
walking. 3781
JFK 3782
airport 3783
unbelievable 3784
cheap. 3785
flooding 3786
forced 3787
evacuate 3788
apartment, 3789
search 3790
dogs 3791
so. 3792
searching 3793
AmEx 3794
emergency 3795
(Great 3796
practical 3797
option. 3798
frequently 3799
often 3800
designs. 3801
performance 3802
significant 3803
urban 3804
family, 3805
Patrick, 3806
Gabriella 3807
, 3808
everyone's 3809
suffice 3810
valet 3811
phenomenal. 3812
Robert, 3813
GM, 3814
warmly 3815
dogs. 3816
hadn't 3817
animals 3818
name 3819
walks. 3820
treats. 3821
scratched 3822
butt 3823
dry 3824
laundry. 3825
spotlessly 3826
gone. 3827
cat 3828
litter 3829
pan 3830
one). 3831
eight 3832
confirmed 3833
relocated 3834
pizza 3835
(from 3836
discovered 3837
Their 3838
sharing 3839
laughing 3840
telling 3841
college. 3842
Beautiful. 3843
Quite 3844
standards, 3845
wood 3846
contemporary 3847
elegant. 3848
Terrific 3849
sheets 3850
killer 3851
hundreds 3852
pets 3853
gotten 3854
Yeah, 3855
THAT 3856
smell. 3857
evidence 3858
odor 3859
dirt 3860
scratches 3861
doors. 3862
unforgettable 3863
life. 3864
neither 3865
shown 3866
much!!! 3867
nights. 3868
bellboys 3869
arranged 3870
size. 3871
vouchers 3872
bar) 3873
wait. 3874
technology 3875
magazines 3876
case, 3877
tv. 3878
grabbing 3879
sandwich 3880
pleasure, 3881
centre, 3882
example, 3883
bear 3884
mind. 3885
romantic 3886
attended 3887
Open. 3888
Broadway, 3889
shoping 3890
(short 3891
(front 3892
concierge) 3893
cheesy 3894
fake, 3895
not. 3896
calming. 3897
technology. 3898
truth 3899
easy, 3900
use, 3901
that? 3902
secure. 3903
requires 3904
recognize 3905
guests. 3906
peaceful 3907
areas 3908
small. 3909
calm, 3910
3-night 3911
Hurricane 3912
enthusiastic 3913
Luckily, 3914
arguing 3915
(got 3916
disappointed 3917
first, 3918
shower! 3919
stall 3920
comfortably! 3921
incredible, 3922
mirror. 3923
Boy 3924
Room: 3925
okay 3926
larger 3927
positioned 3928
well, 3929
closet, 3930
scented 3931
candles 3932
(that 3933
Location: 3934
shows, 3935
upset 3936
please 3937
doorman, 3938
previously; 3939
reserved. 3940
discuss 3941
Brian, 3942
reserved, 3943
one-room 3944
cleaned, 3945
cost 3946
escort 3947
snafu 3948
check-in. 3949
restocked 3950
1000 3951
sq 3952
ft. 3953
Spacious, 3954
laid 3955
treats 3956
cocktails 3957
Bed 3958
Nespresso 3959
touch, 3960
everyway. 3961
ceilings 3962
largest 3963
criticism 3964
late. 3965
ammenities. 3966
CIty 3967
slick 3968
werent 3969
lacked 3970
extras. 3971
joke, 3972
detail. 3973
deal 3974
similar 3975
rates 3976
lifts. 3977
propose 3978
girlfriend. 3979
swift 3980
response 3981
department 3982
polite. 3983
arrival, 3984
early) 3985
informative. 3986
pass 3987
25 3988
hotel). 3989
speed 3990
survive 3991
constant 3992
use! 3993
:). 3994
(possibly 3995
storage. 3996
fantastic! 3997
informative 3998
pushy 3999
(this 4000
partners 4001
shut 4002
reduced 4003
staff) 4004
5) 4005
dollar 4006
duration 4007
date 4008
hurricane. 4009
popular 4010
ages 4011
various 4012
reasons. 4013
agreed 4014
congratulate 4015
encountered. 4016
above. 4017
Centre 4018
safe. 4019
residence 4020
hotel) 4021
dozen 4022
years. 4023
Mary 4024
studio 4025
units. 4026
renovated. 4027
Basically 4028
oldest 4029
daughter's 4030
downtown, 4031
avoid 4032
(though 4033
$2 4034
hotel), 4035
Thursday 4036
afternoons. 4037
availability 4038
roll 4039
six 4040
expensive). 4041
BW 4042
priced 4043
comes 4044
parking. 4045
heartbeat. 4046
drive 4047
cost, 4048
decent. 4049
here, 4050
overlooks 4051
focused. 4052
season 4053
travel, 4054
staff,clean 4055
travel. 4056
conferences. 4057
conference. 4058
hour. 4059
participating 4060
places. 4061
leaves 4062
sub 4063
par. 4064
Buffet 4065
Please 4066
closed. 4067
replaced 4068
appear 4069
anytime 4070
soon. 4071
office. 4072
aware 4073
sidewalks 4074
blocked 4075
self-parking 4076
Self 4077
...it 4078
walkway. 4079
fee. 4080
increase 4081
encountered 4082
appreciates 4083
enough, 4084
always, 4085
AC 4086
Wifi 4087
improved 4088
greasy 4089
sausage 4090
bacon, 4091
rubbery 4092
bread 4093
toast 4094
missed 4095
mornings 4096
Dinner 4097
bothered 4098
elsewhere, 4099
salad 4100
burger 4101
frozen 4102
Check-out 4103
receptionist 4104
acknowledge 4105
dropped 4106
writing 4107
something. 4108
Again 4109
passed 4110
reception, 4111
